{
  "university_president_1": {
    "topic": "university president",
    "information": "Dr. Lilian Diana B. Parreño",
    "added_at": "2025-09-05T06:43:50.590367"
  },
  "gsu_hymn_2": {
    "topic": "gsu hymn",
    "information": "In the towns on the Guimaras shores\r\nstands the University we all honor—\r\nGSU, whom we all adore, with our hearts\r\nand minds and souls.\r\n\r\nIn the halls and throughout the world,\r\nshe will rise and never fall,\r\nour beloved Guimaras State University,\r\na center of excellence and green technology.\r\n\r\nExcellent in education and champions of the Earth,\r\nwe are future global builders pushing boundaries,\r\nchasing our dreams, lifting our banners high up into the sky,\r\nthe world cheering for the children, Mabuhay! Mabuhay!\r\n\r\nA university for all in this part of the western shore,\r\nbrothers and sisters united for a common goal\r\nto lift each other up through education and culture\r\nfor the success of one and all.\r\n\r\nIn the halls and throughout the world,\r\nwe are ready to heed her call,\r\nour beloved Guimaras State University\r\nin the towns on the Guimaras shores.\r\n\r\nExcellent in education and champions of the Earth,\r\nwe are future global builders pushing boundaries,\r\nchasing our dreams, lifting our banners high up into the sky,\r\nthe world cheering for the children, Mabuhay! Mabuhay!\r\n\r\nExcellent in education, Mabuhay! Mabuhay!",
    "added_at": "2025-09-05T09:26:27.616958"
  },
  "cst_dean_3": {
    "topic": "cst dean",
    "information": "Adrian J. Forca, MIT",
    "added_at": "2025-09-05T09:30:48.862256"
  },
  "gsu_history_4": {
    "topic": "gsu history",
    "information": "Guimaras State University had its humble beginnings as a secondary vocational institution, the Buenavista Vocational School (BVS), which was established through Republic Act 3933 in 1964, with Representative Rodolfo Ganzon of the 2nd District of Iloilo as the principal sponsor.",
    "added_at": "2025-09-05T09:39:11.913059"
  },
  "gsu_mandate_5": {
    "topic": "gsu mandate",
    "information": "The University shall primarily provide advance education, higher technological, professional instruction and training in the fields of education, technology, agriculture, fisheries, engineering, arts and sciences, forestry, business administration, hotel and restaurant management, tourism, health sciences, computer technology, criminology, maritime and aviation education, and other related fields of study. It shall also undertake research and extension services, as well as production activities, in support of the socioeconomic development of the Province of Guimaras and Region VI, and provide progressive leadership in its areas of specialization.",
    "added_at": "2025-09-05T09:41:30.492091"
  },
  "gsu_goals_6": {
    "topic": "gsu goals",
    "information": "Goals\r\n1. Instruction\r\nProvide quality education and produce globally competitive, technologically equipped and research-oriented graduates in advanced and higher education programs.\r\n\r\n2. Research\r\nCultivate locally rooted, globally competitive and responsive research culture among faculty, staff and students.\r\n\r\n3. Extension\r\nEngage the faculty, staff and students in sustainable extension services to improve quality of life in the community.\r\n\r\n4. Governance\r\nStrengthen administrative operation, develop human capital and intensify fiscal management for the efficient and effective delivery of public service.",
    "added_at": "2025-09-05T09:45:06.821443"
  },
  "gsu_objectives_7": {
    "topic": "gsu objectives",
    "information": "## Objectives\r\n1. Instruction\r\n   1. Develop and offer programs responsive to the needs of the Nation and industries.\r\n   2. Secure certifications and recognition from credible bodies (Accrediting Agency of Chartered Colleges and Universities in the Philippines (AACCUP), Institutional Sustainability Assessment (ISA), Accreditation Board for Engineering and Technology (ABET), Times Higher Education (THE), Quacquarelli Symonds (QS), SUC Leveling).\r\n   3. Achieve Licensure and first-generation graduate targets.\r\n   4. Ensure career advancement and employability of graduates.\r\n   5. Provide a vibrant and supportive environment for faculty professional development.\r\n   6. Promote initiatives and coordinate college/programs toward student completion and learning outcomes in a holistic environment.\r\n   7. Maintain high quality flexible learning strategies to accommodate wide-ranging students’ needs and experiences.\r\n   8. Provide quality training for tertiary and advanced education and advocate sustainable development through green technology generation.\r\n   9. Develop responsible, environment-friendly, productive, healthy and sports -oriented citizens who can contribute to the attainment of local and national goals.\r\n   10. Foster planning for excellence in instruction, research and community engagement.\r\n   11. Create a vibrant ASEAN/Trans-international and Distance Education.\r\n   12. Innovate research-based pedagogy to foster equitable and inclusive education.\r\n   13. Continue ISO Certification for the management of tertiary and advanced education.\r\n2. Governance\r\n   1. Conduct periodic review, evaluation, and re-engineering of the processes, structures and system.\r\n   2. Improve the delivery of services to stakeholders/clients.\r\n   3. Strengthen the implementation of the automation and digitalization of the administrative and financial management system for efficient and transparent service.\r\n   4. Enhance Human Resource Learning and Development.\r\n3. Research, Extension, Training, and Innovations\r\n   1. Conduct, manage, and supervise gender-responsive Research and Extension activities in consonance with the institutional, national, and international goals.\r\n   2. Present quality research outputs and extension projects in local, national, and international fora and symposia.\r\n   3. Publish research outputs and other scholarly works in reputable publications with Scopus and/or International Scientific Indexing for wide dissemination and circulation.\r\n   4. Establish and intensify the University’s collaboration with public and private local and international organizations towards sustainable development through sharing of resources, skills, expertise, and knowledge.\r\n   5. Extend mature technologies, programs, and innovations to enhance skills, and competencies of stakeholders/clients.\r\n   6. Utilize protected research outputs for technology transfer and commercialization.\r\n   7. Ensure continuous quality improvement in Research, Extension, Training, and Innovations.",
    "added_at": "2025-09-05T09:49:51.702821"
  },
  "gsu_8": {
    "topic": "gsu",
    "information": "Guimaras State University (GSU) is a public university in the island province of Guimaras, Philippines. It is mandated to provide advanced education, higher technological, professional instruction and training in the fields of education, technology, agriculture, fisheries, engineering, arts and sciences, forestry, business administration, hotel and restaurant management, tourism, health sciences, computer technology, criminology, maritime and aviation education, and other related fields of study. It consists of three campuses: the Salvador Campus, Mosqueda Campus, and Baterna Campus.",
    "added_at": "2025-09-05T09:54:56.794922"
  },
  "campus_director_of_gsu_mosqueda_campus_9": {
    "topic": "campus director of gsu mosqueda campus",
    "information": "Dr. Kert D. Pillora",
    "added_at": "2025-09-05T14:02:15.190171"
  },
  "salvador_campus_10": {
    "topic": "salvador campus",
    "information": "Guimaras State University's main campus, known as the Salvador Campus, is located in McLain, Buenavista, the most populous municipality in Guimaras. It occupies a 5-hectare area and serves as the central location for the university's operations and academic programs. The campus offers various undergraduate and graduate programs and is known for its qualified faculty and scholarship opportunities.",
    "added_at": "2025-09-06T14:42:09.047655"
  },
  "tell_me_about_mosqueda_campus_11": {
    "topic": "tell me about mosqueda campus",
    "information": "Mosqueda Campus Colleges:\r\n1. College of Science and Technology (CST)\r\n2. College of Business and Management (CBM)\r\n\r\nMosqueda Campus Courses:\r\n1. Bachelor of Science in Business Administration (Major in: Financial Management, Marketing Management, Human Resource Management)\r\n2. Bachelor of Science in Entrepreneurship\r\n3. Bachelor of Science in Real Estate Management\r\n4. Bachelor of Science in Information Technology\r\n5. Bachelor of Science in Computer Science\r\n6. Bachelor of Science in Information System\r\n7. Bachelor of Science in Entertainment and Multimedia Computing\r\n8. Bachelor of Library and Information Science\r\n\r\nMosqueda campus has atleast 1000 students now",
    "added_at": "2025-09-07T06:54:34.376893"
  },
  "salvador_campus_12": {
    "topic": "salvador campus",
    "information": "Salvador Campus:\r\nGuimaras State University's main campus, known as the Salvador Campus, is located in McLain, Buenavista, the most populous municipality in Guimaras. It occupies a 5-hectare area and serves as the central location for the university's operations and academic programs. The campus offers various undergraduate and graduate programs and is known for its qualified faculty and scholarship opportunities.\r\n\r\nSalvador Campus Colleges:\r\n1. College of Teacher Education (CTE)\r\n2. College of Arts and Sciences (CAS)\r\n3. College of Business Administration (CBA)\r\n4. College of Engineering and Industrial Technology (CEIT)\r\n5. College of Criminal Justice Education (CCJE)\r\n6. College of Tourism and Hospitality Management (CTHM)\r\n7. Graduate School\r\n\r\nSalvador Campus Courses:\r\n1. Bachelor of Arts in English Language Studies\r\n2. Bachelor of Public Administration\r\n3. Bachelor of Science in Hospitality Management\r\n4. Bachelor of Science in Tourism Management\r\n5. Bachelor of Science in Criminology (Board Course)\r\n6. Bachelor of Industrial Technology (Major in: Automotive Technology, Electrical Technology, Electronics Technology, Mechanical Technology)\r\n7. Bachelor of Science in Electrical Engineering (Board Course)\r\n8. Bachelor of Science in Mechanical Engineering (Board Course)\r\n9. Bachelor of Elementary Education (Board Course)\r\n10. Bachelor of Technology and Livelihood Education (Major in: Industrial Arts, Home Economics and Livelihood Education)\r\n11. Master in Public Administration\r\n12. Master in Education\r\n13. Master of Arts in Teaching Mathematics\r\n14. Master in Business Administration\r\n15. Doctor of Philosophy in Educational Management\r\n16. Doctor in Management (Major in: Business Administration, Human Resource Management)\r\n17. Doctor of Education in Curriculum and Instruction",
    "added_at": "2025-09-07T06:57:47.491638"
  },
  "baterna_campus_13": {
    "topic": "baterna campus",
    "information": "Baterna Campus:\r\nThe Baterna Campus of Guimaras State University (GSU) is located in Constancia, San Lorenzo, Guimaras, Philippines. It primarily serves as the home for the university's College of Agricultural Sciences (CAgS).\r\n\r\nBaterna Campus Colleges:\r\n1. College of Agricultural Sciences (CAGS).\r\n\r\nBaterna Campus Courses:\r\n1. Bachelor of Science in Agriculture (Board Course)\r\n2. Bachelor of Science in Food Technology\r\n3. Bachelor of Science in Fisheries (Board Course)",
    "added_at": "2025-09-07T07:00:37.931105"
  },
  "quality_policy_14": {
    "topic": "quality policy",
    "information": "Guimaras State University (GSU) aims to have an effective and efficient implementation of its quality management system along with its vision, mission and core values. To achieve this, GSU will produce globally competitive, technologically-equipped and research-oriented graduates of quality and innovative advanced and higher education programs in sustainable agriculture, fisheries, forestry and tourism, entrepreneurship, liberal arts, education, healthcare, science and good governance. It shall endeavor to continually improve its quality management system, satisfying applicable requirements of the standard, addressing risks and maximizing opportunities. Further, the top Management pledges to inspire a university-wide commitment to this Policy and ensure to regularly review and monitor strategic implementation of the Quality Management System in all levels of the organization for customer’s satisfaction and continual improvement.",
    "added_at": "2025-09-07T07:02:58.342866"
  },
  "core_values_15": {
    "topic": "core values",
    "information": "a. God-Fearing\r\nb. People Centered\r\nc. Pro – Environment\r\nd. Selfless Public Service\r\ne. Respect for Human Dignity",
    "added_at": "2025-09-07T09:17:20.754668"
  },
  "cst_dean_16": {
    "topic": "cst dean",
    "information": "Prof. Adrian J. Forca, MIT",
    "added_at": "2025-09-08T08:02:04.659272"
  },
  "program_head_of_bsit_17": {
    "topic": "program head of bsit",
    "information": "Divon G. Tamdang",
    "added_at": "2025-09-08T08:53:05.844142"
  },
  "who_is_the_university_president_18": {
    "topic": "who is the university president",
    "information": "Dr. Lilian Diana B. Parreño",
    "added_at": "2025-09-08T10:51:05.077254"
  },
  "the_developer_of_this_system_19": {
    "topic": "the developer of this system",
    "information": "EJay",
    "added_at": "2025-09-08T11:02:39.995300"
  },
  "registrar_of_gsu_20": {
    "topic": "registrar of gsu",
    "information": "Ronel P. Dulla",
    "added_at": "2025-09-12T13:11:23.538210"
  },
  "how_many_laboratory_rooms_does_gsu_mosqueda_campus_have_21": {
    "topic": "how many laboratory rooms does gsu mosqueda campus have",
    "information": "four rooms. lab a to d",
    "added_at": "2025-09-13T15:12:16.005168"
  },
  "when_did_gsc_became_gsu_22": {
    "topic": "when did gsc became gsu",
    "information": "The 15th Congress enacted House Bill 06634 (An Act Converting\n\nthe Guimaras State College in The Province of Guimaras Into a State\n\nUniversity to Be Known as The Guimaras State University and Appropriating\n\nFunds Therefor) by former Congressman Joaquin Carlos Rahman Nava. In\n\nDecember 2014, Cong. Rahman Nava refiled HB 05181 in the 16th Congress,\n\nwhich the House approved and sent to the Senate. In the 17th\n\nCongress - Hon. Ma. Lucille Ledesma Nava sponsored HB 07953 to convert\n\nGSC to GSU. On April 26, 2019, President Rodrigo R. Duterte signed Repub\n\nlic Act 11335 an act converting the Guimaras State College into Guimaras\n\nState University. In June 7, 2022, the CHED Commission en Banc\n\nconfirmed the conversion of Guimaras State College into Guimaras State\n\nUniversity.",
    "added_at": "2025-09-14T16:04:58.789349"
  },
  "resolved:_bision_23": {
    "topic": "RESOLVED: bision",
    "information": "[CORRECTED] This question has been marked as resolved by admin on 2025-09-15 08:28",
    "added_at": "2025-09-15T08:28:43.089160"
  },
  "institutional_outcome_for_instruction_24": {
    "topic": "Institutional Outcome for Instruction",
    "information": "1. Spiritually and morally upright individuals\n\n2. Globally competent professionals\n\n3. Productive and Environment friendly\n\n4. Entrepreneurial and technologically innovative\n\n5. Goal-oriented and service committed\n\n6. Sustainable development advocate",
    "added_at": "2025-09-15T12:52:53.626593"
  },
  "goals_of_the_college_of_science_and_technology_25": {
    "topic": "Goals of the College of Science and Technology",
    "information": "1. Provide quality and excellent education and training for the higher manpower skills of technologist, technicians and professionals;\n\n2. Strengthen community involvement for technological and industrial development of the nation;\n\n3. Undertake relevant technological researches and innovations that promote the uses of renewable resources and the conservation of energy and natural resources;\n\n4. Promote production of high-quality goods and efficient services through green technology for socio-economic development.",
    "added_at": "2025-09-15T12:55:09.519415"
  },
  "program_objectives_of_bscs_26": {
    "topic": "Program Objectives of BSCS",
    "information": "A. Develop students for a career in the industry equipped with adequate knowledge and skills to become competent applications developer, computer science instructor, database programmer/designer, information security engineer, quality assurance engineer, researcher, systems developer and systems analyst.\n\nB. Strengthen students capability to become competent global practitioners by actively engaging them through the application and utilization of information and communication technology on instruction, research, extension and production.",
    "added_at": "2025-09-15T12:57:35.725529"
  },
  "bscs_program_outcomes_[cmo_25,_s._2015_section_6.3.a]_27": {
    "topic": "BSCS Program Outcomes [CMO 25, s. 2015 Section 6.3.A]",
    "information": "1. Apply knowledge of computing fundamentals, knowledge of a computing specialization, and mathematics, science, and domain knowledge appropriate for the computing specialization to the abstraction to the abstraction and conceptualization of computing models from defined problems and requirements.\n\n2. Identify, analyze, formulate, research literature, and solve complex computing problems and requirements reaching substantiated conclusions using fundamental principles of mathematics, computing sciences, and relevant domain disciplines.\n\n3. An ability to apply mathematical foundations, algorithmic principles, and computer science theory in the modeling and design of computer-based systems in a way that demonstrates comprehension of the tradeoffs involved in design choices.\n\n4. Knowledge and understanding of information security issues in relation to the design, development, and use of information systems.\n\n5. Design and evaluate solutions for complex computing problems, and design and evaluate systems, components, or processes that meet specified needs with appropriate consideration for public health and safety, cultural, societal, and environment considerations.\n\n6. Create, select, adapt, and apply appropriate techniques, resources, and modern computing activities, with an understanding of the limitations to accomplish a common goal.\n\n7. Function effectively as an individual and as a member or leader in diverse teams and in multidisciplinary settings.\n\n8. Communicate effectively with the computing community and with society at large about complex computing activities being able to comprehend and write effective reports, design documentation, make effective presentations, and give and understand clear instructions.\n\n9. An ability to recognize the legal, social, ethical, and professional issues involved in the utilization of computer technology and be guided by the adoption of appropriate professional, ethical, and legal practices.\n\n10. Recognize the need, and have the ability, to engage in independent learning for continual development as a computing professional.",
    "added_at": "2025-09-15T13:02:37.429347"
  },
  "bscs_curriculum_effective_1st_sem,_ay_2025-2026_28": {
    "topic": "BSCS Curriculum Effective 1st Sem, AY 2025-2026",
    "information": "General Education Courses:\n\nGE 1 - Purposive Communication\n\nGE 2- Readings in Philippine History\n\nGE 3- Mathematics in the Modern World\n\nGE 4 - Art Appreciation\n\nGE 5 - Understanding the Self\n\nGE 6 - Ethics\n\nGE 7 - The Contemporary World\n\nGE 8- Science, Technology and Society\n\nGE 9- Technical Writing with Oral Communication\n\nCommon Courses:\n\nCC 01 - Introduction to Computing\n\nCC 02 -Fundamentals of Programming\n\nCC 03 - Intermedia Programming\n\nProfessional Courses:\n\nCS 1 -Programming Logic Formulation\n\nCS 2- Discrete Structures I\n\nCS 3 - System Fundamentals\n\nCS 4- Networks and Communications\n\nInstitutional:\n\nGTE - Green Technology Education I\n\nPhysical Education:\n\nPE 1 - Physical Activities Towards Health and Fitness 1 (PATHFit 1): Movement Competency Training\n\nPE 2 - Physical Activities Towards Health and Fitness 2 (PATHFit 2): Exercise-based Fitness Activities\n\nNSTP:\n\nNSPT 1 - CWTS/ ROTC/ LTS\n\nNSPT 2 - CWTS/ ROTC/ LTS",
    "added_at": "2025-09-15T13:06:43.704772"
  },
  "program_objectives_of_bachelor_of_science_in_entertainment_and_multimedia_computing_29": {
    "topic": "Program Objectives of Bachelor of Science in Entertainment and Multimedia Computing",
    "information": "A. Promote innovative digital animation content and applications that adhere to ethical and professional standards;\n\nB. Produce innovative solutions and creative content that address the evolving needs of the entertainment and multimedia industries.\n\nC. Generate research-driven outcomes that contribute to the advancement of knowledge and practices in entertainment and multimedia computing; and\n\nD. Foster creativity and critical thinking skills to solve complex problems in multimedia design and entertainment technology.",
    "added_at": "2025-09-15T13:09:18.293071"
  },
  "bachelor_of_science_in_entertainment_and_multimedia_computing_program_outcomes_[cmo_2,_s._2014_section_6.2]_30": {
    "topic": "Bachelor of Science in Entertainment and Multimedia Computing Program Outcomes [CMO 2, s. 2014 Section 6.2]",
    "information": "1. Apply knowledge of mathematics, physical sciences, computing sciences to the practice of being an entertainment and\n\nmultimedia computing professional.\n\n2. Specialized computing knowledge in each applicable field, and the ability to apply such knowledge to provide solutions to actual problems.\n\n3. A knowledge of contemporary issues.\n\n4. Analyze project requirements and to design and implement project prototypes.\n\n5. Recognize, formulate, and solve computing problems.\n\n6. Design, build, improve, and deploy products that meets client needs within realistic constraints.\n\n7. Use the appropriate techniques, skills and modern computing tools necessary for the practice of being a professional game developer or animator.\n\n8. Work effectively in multi-disciplinary and multi- cultural teams.\n\n9. Effectively communicate orally and in writing using the English language.\n\n10. Understand and assess local and global impacts of computing on society relevant to professional computing practice and subscription to accepted industry standards.\n\n11. Understand the effects and impact of entertainment and multimedia computing projects on nature and society, and of their social and ethical responsibilities.\n\n12. Create or use modified artifacts in consideration of intellectual property rights of the author.\n\n13. Engage in life-long learning and an acceptance of the need to keep current of the development in the specific field of specialization.\n\n14. Demonstrate original creative outputs.\n\n15. Demonstrate innovativeness in their outputs.\n\n16. Demonstrate client-centric service.",
    "added_at": "2025-09-15T13:11:55.932633"
  },
  "program_objectives_of_bachelor_of_library_and_information_science_31": {
    "topic": "Program Objectives of Bachelor of Library and Information Science",
    "information": "A. Equip students with essential skills in managing, organizing, and accessing information in both physical and digital formats, ensuring proficiency in cataloging, classification, and archiving systems.\n\nB. Encourage students to engage in research methodologies and critical analysis of information systems, allowing them to evaluate, select, and apply the best practices for information retrieval and dissemination in diverse contexts.\n\nC. Prepare students to integrate emerging technologies into library and information services, emphasizing the use of digital tools, databases, and information management software to meet the evolving needs of information users.\n\nD. Instill a strong sense of ethics and responsibility in students, emphasizing the importance of intellectual freedom, privacy, and the role of libraries and information professionals in supporting lifelong learning and community development.",
    "added_at": "2025-09-15T13:14:19.193289"
  },
  "bachelor_of_library_and_information_science_program_outcomes_[cmo_24,_s._2015_section_6.2]_32": {
    "topic": "Bachelor of Library and Information Science Program Outcomes [CMO 24, s. 2015 Section 6.2]",
    "information": "1. Select, evaluate, organize and disseminate print, multimedia, electronic and digital information resources.\n\n2. Effectively communicate orally and in writing, at the same time, use a variety of communication methods in a manner that best enables the message to be understood.\n\n3. Demonstrate logical and systematic approaches to the accomplishment of tasks.\n\n4. Formulate objectives, policies and processes as well as design and manage resources in anticipation of future educational or organizational changes.\n\n5. Recognize, analyze and constructively solve problems, provide appropriate direction and assistance, and overcome barriers when necessary.\n\n6. Identify users’ needs and wants through reference interviews. customer surveys, complaint logs and other means in order to evaluate the effectiveness of current services and improve these and other practices.\n\n7. Work well in groups and seek ways to build team efforts to solve problems and achieve common goals.\n\n8. Understand library’s automation systems and the use of computer hardware, software and peripherals, including online collaboration tools (the Internet, the worldwide web, and social networking sites) i) develop information technology solutions (e.g.. library automation system. Website, e-mail system, etc.).\n\n9. Conduct significant research projects that will benefit the library and the organization.\n\n10. Evaluate and debate information policy (e.g., copyright law, plagiarism, cybercrimes, etc.) and ethical issues applicable in local, national or global context.\n\n11. Participate in continuing education activities organized by library associations and other entities.",
    "added_at": "2025-09-15T13:17:33.951208"
  },
  "program_objectives_of_bachelor_of_science_in_information_systems_33": {
    "topic": "Program Objectives of Bachelor of Science in Information Systems",
    "information": "A. Produce graduates who are equipped with current technologies and tools, as well as, quality assurance methodologies that will lead to the development of implementation-ready information systems.\n\nB. Enhance awareness on how to methodically and practically approach a variety of technical, organizational, and managerial issues to ultimately improve C. ICT integration towards the attainment of strategic business advantage.\n\nD. Inculcate among students the essential virtues and attitudes, as well as develop necessary knowledge and competency levels required of an information technology professional.\n\nE. Train students to systematically appraise the quality of computer-based information systems against user needs and requirements to guarantee user acceptance and implement ability.",
    "added_at": "2025-09-15T13:20:16.406284"
  },
  "bachelor_of_science_in_information_systems_program_outcomes_[cmo_25,_s._2015_section_6.3.b]_34": {
    "topic": "Bachelor of Science in Information Systems Program Outcomes [CMO 25, s. 2015 Section 6.3.B]",
    "information": "1. Apply knowledge of business processes, computer, mathematics and social sciences appropriate to Information Systems\n\n2. Analyze a problem, identify and define the computing requirements with respect to organizational factors appropriate to its solution and plan strategies for their solution\n\n3. Evaluate information systems in terms of general quality attributes and possible trade-offs presented with the given requirement\n\n4. Design, implement, and evaluate information systems, processes, components, or programs and to source cost-benefits efficient alternatives to meet desired needs, goals and constraints\n\n5. Use knowledge and understanding of enterprises in modelling and design of information systems\n\n6. Deploy and use effectively skills, tools and techniques necessary for information systems practice\n\n7. Function effectively on teams (recognizing the different roles within a team and different ways of organizing teams) to accomplish a common goal\n\n8. Communicate effectively with a range of audiences Communication skills includes technical writing, presentation and negotiation and numeracy\n\n9. Recognize the legal, social, ethical and professional issues involved in the exploitation of computer technology, and be guided by the adoption of appropriate professional, ethical and legal practices both in the local and global community\n\n10. Recognize the need for and engage in an independent and life-long learning, planning self-learning and improving performance as the foundation for on-going professional development",
    "added_at": "2025-09-15T13:22:16.713245"
  },
  "program_objectives_of_bachelor_of_science_in_information_technology_(bsit)_35": {
    "topic": "Program Objectives of Bachelor of Science in Information Technology (BSIT)",
    "information": "A. Produce globally competitive, innovative, God-fearing, morally upright and productive information technology professionals;\n\nB. Transfer ICT knowledge and skills for better quality of life of the community;\n\nC. Develop research capabilities for industrial and technological innovations;\n\nD. Engage in revenue-generating ICT jobs and other environment-friendly computing services.",
    "added_at": "2025-09-16T14:42:16.289019"
  },
  "bachelor_of_science_in_information_technology_(bsit)_program_outcomes_[cmo_25,_s._2015_section_6.3.c]_36": {
    "topic": "Bachelor of Science in Information Technology (BSIT) Program Outcomes [CMO 25, s. 2015 Section 6.3.C]",
    "information": "1. Apply knowledge of computing, science, and mathematics appropriate to the discipline\n\n2. Understand best practices and standard and their applications\n\n3. Analyze complex problems, and identify and design the computing requirements appropriate to its solution\n\n4. Identify and analyze user needs and take them into account in the selection, creation, evaluation and administration of computer-based systems\n\n5. Design, implement, and evaluate computer-based systems, processes, components, or programs to meet desired needs and requirements under various constraints\n\n6. Integrate IT-based solutions into the user environment effectively\n\n7. Apply knowledge through the use of current techniques, skills, tolls, and practices necessary for the IT Profession\n\n8. Function effectively as a member or leader of a development team recognizing the different roles within a team to accomplish a common goal\n\n9. Assist in the creation of an effective IT Project Plan\n\n10. Communicate effectively with the computing community and with society at large about complex computing activities through logical writing, presentations, and clear instructions\n\n11. Analyze the local and global impact of computing information technology on individuals, organizations, and society\n\n12. Understand professional, ethical, legal and security and social issues and responsibilities in the utilization of information technology\n\n13. Recognize the need for and engage in planning self-learning and improving performance as a foundation for continuing professional development",
    "added_at": "2025-09-16T14:44:43.826617"
  },
  "bsit_curriculum_effective_1st_sem,_ay_2025-2026_37": {
    "topic": "BSIT Curriculum Effective 1st Sem, AY 2025-2026",
    "information": "General Education Courses\n\n[GE 1] Understanding the Self\n\n[GE 2] Readings in Philippine History\n\n[GE 3] Contemporary World\n\n[GE 4] Mathematics in the Modern World\n\n[GE 5] Purposive Communication\n\n[GE 6] Art Appreciation\n\n[GE 7] Science, Technology and Society\n\n[GE 8] Ethics",
    "added_at": "2025-09-16T14:45:57.517344"
  },
  "osds_objectives_38": {
    "topic": "osds objectives",
    "information": "1. Enhance the capability of clubs/ organizations adviser’s and student\n\nleaders to develop well-rounded and globally competitive graduates.\n\n2. Generate funding for Scholarship from various funding donors.\n\n3. Provide continuous skills enhancement for active participation of\n\nstudents to the programs and activities of the university.\n\n4. Promote the research culture among students on development and community extension services.\n\n5. Develop sense of responsibility among students to make Guimaras State\n\n6. University a green technology campus through environment friendly\n\nactivities, programs and services.",
    "added_at": "2025-09-16T14:52:52.015372"
  },
  "who_is_the_program_head_of_bscs_39": {
    "topic": "who is the program head of bscs",
    "information": "Lea P. Ymalay",
    "added_at": "2025-09-19T14:40:46.078046"
  },
  "who_is_the_program_head_of_bsis_40": {
    "topic": "who is the program head of bsis",
    "information": "Loveson C. Gallos",
    "added_at": "2025-09-19T15:10:18.755825"
  },
  "who_is_the_dean_of_cags_41": {
    "topic": "who is the dean of cags",
    "information": "Dr. Rhea Joy D. Flora",
    "added_at": "2025-09-20T14:25:35.443623"
  },
  "cags_42": {
    "topic": "cags",
    "information": "College of Agricultural Sciences",
    "added_at": "2025-09-20T14:29:24.148603"
  },
  "cas_43": {
    "topic": "cas",
    "information": "College of Arts and Sciences",
    "added_at": "2025-09-21T06:51:02.614150"
  },
  "who_is_the_dean_of_cas_44": {
    "topic": "who is the dean of cas",
    "information": "Dr. Bernardo G. Cagasan",
    "added_at": "2025-09-21T08:57:21.351060"
  },
  "ccje_45": {
    "topic": "ccje",
    "information": "College of Criminal Justice Education (CCJE)\n\nDean: Dr. Jasmin L. Parreño",
    "added_at": "2025-09-21T09:25:25.650146"
  },
  "ceit_46": {
    "topic": "ceit",
    "information": "College of Engineering and Industrial Technology (CEIT)\n\nDean: Engr. Conrado S. Calumpita",
    "added_at": "2025-09-21T09:27:32.548746"
  },
  "cte_47": {
    "topic": "cte",
    "information": "College of Teacher Education (CTE)\n\nDean: Dr. Jasmin T. Gadian",
    "added_at": "2025-09-21T09:29:11.042121"
  },
  "dean_of_graduate_school_48": {
    "topic": "dean of graduate school",
    "information": "Dr. Erly M. Martir",
    "added_at": "2025-09-21T09:31:05.692386"
  },
  "baterna_campus_director_49": {
    "topic": "baterna campus director",
    "information": "Dr. Rhea Joy D. Flora",
    "added_at": "2025-09-21T09:33:22.673951"
  },
  "dr._rhea_joy_d._flora_50": {
    "topic": "Dr. Rhea Joy D. Flora",
    "information": "dean of cags, baterna campus director",
    "added_at": "2025-09-21T09:41:14.234321"
  },
  "dr._erly_m._martir_51": {
    "topic": "Dr. Erly M. Martir",
    "information": "Vice President for Academic Affairs, dean of graduate school",
    "added_at": "2025-09-21T11:46:13.797662"
  },
  "vice_president_for_research,_extension,_training_and_innovation_52": {
    "topic": "Vice President for Research, Extension, Training and Innovation",
    "information": "Dr. Julius T. Vergara",
    "added_at": "2025-09-21T11:49:29.095996"
  },
  "vice_president_for_administration_and_finance_53": {
    "topic": "Vice President for Administration and Finance",
    "information": "Janet R. Aleman",
    "added_at": "2025-09-21T11:50:03.327257"
  },
  "system_name_54": {
    "topic": "system name",
    "information": "ChatBook AI",
    "added_at": "2025-10-28T17:13:38.934441"
  },
  "main_color": {
    "topic": "main color",
    "information": "blue",
    "added_at": "2025-10-28T17:22:29.822783"
  },
  "misyon": {
    "topic": "misyon",
    "information": "GSU is committed to produce globally-competitive, technologically-equipped and research-oriented graduates of quality and innovative advanced and higher education programs in sustainable agriculture, fisheries, forestry and tourism, entrepreneurship,liberal arts, education, healthcare, sciences and good governance.",
    "added_at": "2025-10-30T09:49:54.023331"
  },
  "bisyon": {
    "topic": "bisyon",
    "information": "By 2040, GSU is a premier university on education, green technology, innovations,and community transformation excelling in the holistic development of globally competitive, locally responsive and resilient human capital.",
    "added_at": "2025-10-30T09:51:42.953012"
  },
  "where_is_gsu_mosqueda_located": {
    "topic": "where is gsu mosqueda located",
    "information": "Guimaras State University (GSU) Mosqueda Campus is located in the municipality of Jordan, Guimaras, Philippines.",
    "added_at": "2025-10-30T12:02:09.419755"
  },
  "student_manifesto": {
    "topic": "student manifesto",
    "information": "I,  \r\na student of Guimaras State University, Main/Mosqueda \r\nCampus, do hereby pledge to obey all school rules and regulations promul\r\ngated by the duly constituted authorities of this School: \r\nThat I fully understand the provisions of the Student Conduct and \r\nDiscipline, together with the disciplinary sanctions that the school authori\r\nties may impose upon violation. \r\nIn the presence of my father/mother/guardian, I hereunto affix my \r\nsignature this  day of  ,  , at Guimaras State University, Main/\r\n Mosqueda Campus, Guimaras Philippines.",
    "added_at": "2025-11-10T14:54:48.214770"
  },
  "foreign_and_international_student_services": {
    "topic": "Foreign and International Student Services",
    "information": "1. All foreign students shall be subjected to DFA, CHED, and \r\nuniversity rules and regulations. In addition to these rules and \r\nregulations, the Director of Student Development and        \r\nServices may issue the necessary guidelines to ensure the    \r\ngeneral welfare for special orientation. \r\n2. Immediately after having been admitted to this university, \r\nthe foreign student shall report to the office of the Director \r\nof Student Development and Services shall designate a faculty \r\nadviser for foreign students. \r\n3. Financial support of fifteen thousand pesos (Php 15,000.00) \r\nshall be  provided for students who will be traveling abroad \r\nwhich will be taken from the departmental fee. This           \r\nprovision will be applied to all programs equally but limited \r\nonly to a maximum of five (5) students per  program           \r\ndepending upon the availability of funds.",
    "added_at": "2025-11-13T07:31:07.403397"
  },
  "history_of_the_guimaras_state_university": {
    "topic": "History of the Guimaras State University",
    "information": "Guimaras State University had its humble beginning as a secondary \r\nvocational institution, the Buenavista Vocational School (BVS), which was \r\ncreated by virtue of Republic Act 3933 in 1964 with Representative Rodolfo \r\nGanzon of the 2nd District of Iloilo as the principal sponsor. \r\nThe establishment of BVS was the culmination of the efforts of \r\nmany local officials starting with Hon. Tomas Junco who sponsored a         \r\nresolution requesting the statesmen in Congress to establish a vocational \r\nschool in Buenavista in 1962. With the passage of RA 3933 in 1964,          \r\nCongressman Fermin Caram of the Lone District of Iloilo City exerted effort \r\nfor the implementation of the law. Four years later, through the efforts of \r\nAtty. Ernesto Gaduyon and Governor Abelardo Javellana, the philanthropist, \r\nAtty. Juan Salvador, donated 50,000 square meters lot of his estate in         \r\nBarangay Mclain, Buenavista, Guimaras, to be the school site. \r\nIn 1980, the school was granted a permit to offer post-secondary \r\ncourses. The two-year trade technical and technology courses paved the way \r\nfor the offering of higher education courses, which were either terminal or \r\nladderized courses. In 1992, the Sangguniang Bayan of Buenavista passed a \r\nresolution requesting Representative Alberto Lopez of the Second District of \r\nIloilo to work for the conversion of BVS to Guimaras Polytechnic College. \r\nIn July 1994, Representative Lopez filed House Bill 6252 in Congress \r\nseeking the conversion of BVS into a Polytechnic College. In March 1995, \r\nPresident Fidel V. Ramos signed into law Republic Act 7944, paving the way \r\nfor the conversion of Buenavista Vocational School into Guimaras               \r\nPolytechnic College. In June 2000, a consultation and public hearing on \r\nHouse Bill Nos. 7382 and 5807 sponsored by Representative Emily R. Lopez \r\nof the Lone District of Guimaras was conducted at the GPC Function Room. \r\nWith 179 registered participants from public and private sectors in            \r\nattendance, all sectoral representatives expressed full support for the          \r\nconversion of GPC, Buenavista and West Visayas College of Science and \r\nTechnology (WVCST) Mosqueda Campus in the Municipality of Jordan, into a \r\nState College. \r\nThen, in the eleventh congress first regular session, Congressman \r\nDante V. Liban and Congresswoman Emily R. Lopez filed House Bill 12358 \r\n(substituting House Bills 5807 & 7382). \r\nOn June 8, 2001, the long cherished dream of GPC community   \r\nbecame a reality with the signing into law by President Gloria M. Arroyo of \r\nRepublic Act 9138, establishing the Guimaras State College, integrating \r\ntherewith the Guimaras Polytechnic College in the Municipality of           \r\nBuenavista, and the Western Visayas College of Science and Technology – \r\nGuimaras Extension in the Municipality of   Jordan. \r\nThe 15th Congress enacted House Bill 06634 (An Act Converting \r\nthe Guimaras State College in The Province of Guimaras Into a State        \r\nUniversity to Be Known as The Guimaras State University and Appropriating \r\nFunds Therefor) by  former Congressman Joaquin Carlos Rahman Nava. In \r\nDecember 2014, Cong.  Rahman Nava refiled HB 05181 in the 16th Congress, \r\nwhich the House approved and sent to the Senate. In the 17th                  \r\nCongress - Hon. Ma. Lucille Ledesma Nava sponsored HB 07953 to convert \r\nGSC to GSU. On April 26, 2019, President Rodrigo R. Duterte signed  Repub\r\nlic Act 11335 an act converting the Guimaras State College into Guimaras \r\nState University. In June 7, 2022, the CHED Commission en Banc             \r\nconfirmed the conversion of Guimaras State College into Guimaras State    \r\nUniversity.  \r\nGSU is mandated to offer undergraduate and graduate courses in \r\ntechnology education, agriculture, fishery, engineering, arts and sciences, \r\nforestry, business, health, computer, criminology, nautical and short-term \r\nvocational- technical and other continuing courses that may be found to be \r\nneeded and relevant. \r\nAt last, Guimarasnons have the opportunity to be educated and   \r\nbecome professionals right in their own turf, spending less for quality         \r\neducation.",
    "added_at": "2025-11-13T07:33:54.811493"
  },
  "history_of_mosqueda_campus": {
    "topic": "history of mosqueda campus",
    "information": "By virtue of Republic Act 9138, the WVCST- Guimaras Extension     \r\nCampus in Alaguisoc, Jordan was officially turned over to the Guimaras State \r\nUniversity of the Province of Guimaras during the celebration of the annual \r\nManggahan Festival. It is now known as the Guimaras State University - \r\nMosqueda Campus.",
    "added_at": "2025-11-13T07:37:09.216172"
  },
  "class_size": {
    "topic": "class size",
    "information": "The size of the class shall depend upon accommodation and the    \r\nnature of class activity whether lecture/discussion or laboratory. The          \r\nmaximum class size for the different class activities shall be as follows: \r\nLecture/discussion-------------------- \r\nShop Laboratory---------------------- \r\nScience Laboratory ------------------ \r\nComputer/HRM Laboratory -------- \r\n40 \r\n35 \r\n50 \r\n30 \r\nThe minimum class size for different class activities shall be as follows: \r\nLecture/discussion-------------------- \r\nShop Laboratory---------------------- \r\nScience Laboratory ------------------ \r\nComputer/HRM Laboratory -------- \r\n30 \r\n20 \r\n30 \r\n25 \r\nClass sections may be fused for valid reasons provided that the \r\nclass does not exceed the maximum set. Every college or unit shall have \r\nthe general authority to limit its enrolment if necessary, subject to the \r\napproval of the University President.",
    "added_at": "2025-11-13T07:47:40.602078"
  },
  "dismissal_and_postponement_of_classes": {
    "topic": "Dismissal and Postponement of Classes",
    "information": "Classes shall start promptly as scheduled. \r\nClasses shall be dismissed five (5) minutes before the scheduled \r\ntime to give the students enough time to transfer to other rooms. Teachers \r\nmay dismiss their\r\n classes early only when needed and with the authority \r\nfrom the College Dean and approved by the University President. No \r\nteacher shall transfer the holding of his class to any other hour or room or \r\nshall meet his class for consultation purposes in any unscheduled room or \r\nplace except when permitted by the College Dean and approved by the \r\nVPAA. \r\nAll classes shall be automatically suspended when the Weather \r\nBureau raises typhoon signal number (3) in the area of the University and \r\nin such other events as determined by the University President.",
    "added_at": "2025-11-13T07:49:45.065960"
  },
  "rules_and_regulations_on_conduct_and_discipline": {
    "topic": "Rules and Regulations on Conduct and Discipline",
    "information": "All students shall, at all times, observe the laws of the land and \r\nthe rules and regulations of the university. They should not commit \r\nany of the following: \r\n1. Any form of cheating during examinations or any act of dishonesty; \r\n2. Carrying within the premises of the university any firearm, knife \r\nwith blade, or any other dangerous or deadly weapon; except those \r\nallowed by duly constituted authorities; \r\n3. Drinking alcoholic beverages, or drunken misbehavior within    \r\nuniversity premises or any area while performing university\r\nrelated activities; \r\n4. Unauthorized or illegal possession or use of prohibited drugs or \r\nchemicals; \r\n5. Gross discourtesy; \r\n6. Creating serious disturbance of the peace within the university \r\npremises or participating therein resulting in violence or damage to \r\nproperty and persons; \r\n7. Intentionally making false statement of any material fact, or     \r\npracticing or attempting to practice any deception or fraud in    \r\nconnection with admission, registration, promotion or graduation \r\nfrom the university; \r\n8. Smoking or gambling within the university; \r\n9. Any violation of law committed within the university; \r\n10. Absenteeism; \r\n11. Littering \r\n12. Vandalism/ graffiti; \r\n13. Posting bills in unauthorized areas and similar offenses specified by \r\nthe Committee on Students’ Discipline; \r\n14. Unethical acts related to cyber etiquettes; and \r\n15. Loitering.",
    "added_at": "2025-11-13T07:52:14.755413"
  },
  "classification_of_students": {
    "topic": "classification of students",
    "information": "F.1 Students shall be classified as follows: \r\nRegular- A regular student is registered for normal academic credits \r\nand who carries the course called for in a given semester based on the curricu\r\nlum for which he is registered. \r\nIrregular- An irregular student is one who is registered for normal \r\ncredits but does not carry the full load by semester based on the curriculum \r\nfor which he is registered. \r\nF.2 other classifications of students are as follows; \r\nFreshman- A freshman is a student who has not finished the pre\r\nscribed subjects of the first year of his curriculum or 25% of the total number \r\nof units required in his entire four-year degree program or 50% in the case of \r\nthe two-year certificate of craftsmanship. \r\nSophomore- is a student who has satisfactorily completed the pre\r\nscribed subject; of the first year of his curriculum, or has finished more than \r\n25% but not more than 50% of the total number of units required by his en\r\ntire four-year degree program or more that 50% in the case of the two-year \r\ncertificate of craftsmanship program. \r\nJunior- A junior student is one who has completed the prescribed sub\r\nject of the first two years of his curriculum or has finished more than 50% but \r\nnot more than 75% of the total number of units required by his entire four\r\nyear degree programs. \r\nSenior- A senior student is one who has completed the prescribed \r\nsubject of the first year, second and third years of his curriculum or has fin\r\nished more than 75% of the total number of units required by his entire four\r\nyear degree program.",
    "added_at": "2025-11-13T07:54:55.556661"
  },
  "changing_adding_dropping_of_subjects": {
    "topic": "Changing, Adding, Dropping of Subjects",
    "information": "Changing, adding, withdrawing, or dropping of subjects shall be made \r\nand completed within two (1) week after the start of classes as scheduled. \r\nA student may within the knowledge of the Instructor of the subject \r\nand consent of the adviser and dean, drop the subject by filling in the pre\r\nscribed form and passing it through the accounting office before filing with \r\nthe Office of the Dean and Registrar. \r\nA student who drops the subject after the midterm grade has been \r\ngiven is considered as having failed the subject and is therefore given of “5.0”. \r\nTransfer of subject to other class or section shall be made only with \r\nthe consent of the instructors and dean concerned.",
    "added_at": "2025-11-13T08:00:07.061659"
  },
  "unauthorized_dropping": {
    "topic": "unauthorized dropping",
    "information": "A student who intends to drop a subject shall first notify the teacher \r\nconcerned. Then the student’s adviser shall recommend approval of the drop\r\nping of the subject to the School Dean who shall endorse the form to the of\r\nf\r\n ice of the Registrar. \r\nA student who withdraws a subject with the approval of the School \r\nDean shall be marked “Withdrawn” while a student, who fails to withdraw \r\nofficially, shall be marked “DROPPED”. \r\nA student who drops a subject after the conduct of the midterm exam \r\nis considered as failure and is therefore given a grade of 5.0. \r\nTransfer of subject to other class or section shall be made only upon \r\nthe consent of the concerned instructors . \r\nA student is dropped from his class if: \r\n1. He has incurred unexcused absences equivalent to 20% of the total number \r\nof hours per semester. \r\n2. He has presented a notice of dropping the subject due to reasons of illness. \r\n3. Transfer of residence elsewhere or abroad or any justifiable reason. \r\nIf a student fails to present his official notice of dropping without any \r\nmeritorious reason like sickness and transfer of residence after the midterm \r\nperiod, the faculty member shall automatically give the student a grade of 5.0. \r\nOfficial dropping of a subject before the midterm does not require the \r\npayment of balance of his tuition and other school fees. \r\nAfter the midterm the student may be allowed to drop officially but he should \r\nbe required to pay the balance of his school fees.",
    "added_at": "2025-11-13T08:02:16.629715"
  },
  "grading_system": {
    "topic": "grading system",
    "information": "The performance of students in class shall be graded at the end of \r\neach term using numerical grades which are as follows: \r\n\r\nNumerical Grade | Percent Equivalent | Qualitative\r\n1.0 — 95 — Excellent\r\n1.1–1.5 — 90–94 — Superior\r\n1.6–2.0 — 85–89 — Very Good\r\n2.1–2.5 — 80–84 — Good\r\n2.6–3.0 — 75–79 — Passing\r\n3.1–4.0 — — Conditional\r\n4.1–5.0 — — Failure\r\nInc — — Incomplete\r\n\r\nNo grade of 3.5 or 4.0 may be given as a final grade. Such grades \r\nmay be given only as mid-term grades. Final grade is the average of the \r\nmidterm grade and final term. \r\n“Inc.”- indicates that the work is incomplete. It is given to a student \r\nwhose class standing throughout the term is\r\n passing but fails to take the \r\nf\r\n inal examination or to submit other requirements for valid reason. If the \r\nreason is deemed justifiable by the dean, the student may be given the      \r\nexamination and he is given a grade of 3.0 or better if he passes the          \r\nexamination. However if he fails then his final grade is 5.0. In case the class \r\nstanding is not passing and the student fails to take the final examination for \r\nvalid reason a grade of 5.0 shall be given. A final grade of 3.0 or better is \r\ngiven to the student after he has complied with the requirements, otherwise \r\nthe grade shall be 5.0. \r\nStudent Handbook \r\nDropped- Given to those who voluntarily drop the course or are dropped by the \r\nteacher for excessive absences. \r\nEvery faculty member of the College shall submit his report of grades not \r\nlater than ten (10) calendar days after the last day of the midterm and final        \r\nexamination. \r\nNumerical grades shall not be changed after the grade sheets have been \r\nf\r\n iled at the Office of the Registrar. In case an error has been committed, the \r\nteacher concerned make proper correction upon the authority of the Academic \r\nCouncil and upon recommendation of the dean concerned. If the request is    \r\ngranted, a copy of authorization as reflected in the minutes of the meeting of the \r\nCouncil shall be forwarded to the Office of the Registrar for recording and filing \r\nwith the student’s permanent record. \r\nC. Removal of Incomplete (INC) \r\n1. The period for compliance of an incomplete grade must not exceed one      \r\ncalendar year from the date the grade was received. \r\n2. A grade of “Inc.” when not complied within one-year shall automatically   \r\nbecome 5.0. The Registrar is authorized to implement this policy. \r\n3. An “Inc.” grade is removed upon the completion of the requirements and    \r\npayment for Completion Form for Incomplete Grades is made at the Cashier’s \r\nOffice. The removal of the “inc.” is subject to the approval of the dean.",
    "added_at": "2025-11-13T09:47:05.010941"
  },
  "graduation_requirements": {
    "topic": "graduation requirements",
    "information": "A. General \r\nA student shall be recommended for graduation only after he has           \r\nsatisfied all academic and other requirements for graduation prescribed in his      \r\ncurriculum. A graduating student shall, within two weeks after enrolment of his \r\nlast semester in the college submit for evaluation of the dean his application for \r\ngraduation. The university registrar shall post on the bulletin board a complete list \r\nof candidates for graduation at least two months before the date of  graduation. The \r\nlist of candidates for graduation must be deliberated upon and endorsed by the   \r\nAcademic Council to the Board of Trustees at least a month before the date of \r\ngraduation. All candidates for graduation shall have their deficiencies settled and \r\ntheir records cleared two months before the date of  graduation. No student shall be \r\nconferred any title or degree if he has no money or property clearance. No diploma \r\nfor the completion of the curriculum will be issued to a student unless he has    \r\ncompleted the last two curriculum years for a four-year degree course and the last \r\none curriculum year for a two-year non-degree course. \r\nB. Graduation with Honors \r\nStudents who are candidates for graduation with honors must have \r\ncompleted in the college at least 75% of the total number of academic units    \r\nrequired for graduation and must have been in residence therein for at least one \r\nyears immediately prior to graduation. \r\nIn order to qualify for the Roll of Honors, a student must obtain an   \r\naverage grade of at least 1.7 (88%) and have no final grade lower than 2.0 (85%) \r\nin any subject. NSTP/ROTC will not qualify the student in the list of honor roll. \r\nStudents who complete their course with the following range of \r\nweighted averages shall graduate with honors to be inscribed on their diplomas. \r\nCum Laude  \r\n1.25\r\n1.50-1.75 \r\nFor non-baccalaureate courses, student graduating with honors shall be \r\nconferred “With Honors”, “With High Honors” or “With Highest Honors”. In \r\nthe computation of the final average grade of students who are candidate for \r\ngraduation with honors, only credits earned while in residence shall be consid\r\nered in the computation. Students who are candidates for graduation with hon\r\nors should take a load of at least eighteen (18) units per semester. \r\nC. Commencement and Baccalaureate Exercises \r\nThe commencement and baccalaureate exercises for all graduating    \r\nstudents shall be held on the date fixed for graduation on the academic year. \r\nAll graduating students shall attend the commencement and             \r\nbaccalaureate exercises as scheduled except for some valid reasons which must \r\nbe supported by strong evidence. \r\nThe scholarship enjoyed by the graduating student shall be indicated in \r\nthe recognition program. \r\nD. Academic Costume/Gown \r\nCandidates for graduation with degrees, titles or certificates, as well as \r\nmembers of the academic staff of the University and key personnel shall be      \r\nrequired to wear academic costumes/gown during the baccalaureate services and \r\ncommencement exercises in accordance with the rules and regulations of the \r\nuniversity.",
    "added_at": "2025-11-13T09:52:20.820207"
  },
  "student_welfare": {
    "topic": "student welfare",
    "information": "A. Guidance and Counseling Services \r\nThe Guidance and Counseling Services offer varied services to assist \r\nstudents in fulfilling the academic, emotional, spiritual, and personal needs. \r\nThe Individual Inventory Service. This service provides data about \r\nthe individual student which are needed by the counselor for the counseling. \r\nThrough the Guidance Form 1 or Student Information Record, infor\r\nmation about the student, his/her family, educational/ vocational background \r\ncould be collected. The Form is filled out by the student at the start of his/ her \r\nf\r\n irst term. All collected data go into a cumulative envelope which is kept in \r\nlocked cabinets to protect the students’ privacy. All records will be secured in \r\ncabinet with lock and only be available to anyone with prior consent of the \r\nstudent and that in accordance with the Data Privacy Law of the Philippines. \r\nStudent Handbook \r\nInformation Service. This service provides the individual with information he/\r\n she needed in order for him/her to make intelligent decisions towards his/her \r\neducation, scholarship, and occupation. The more comprehensive and updated \r\nthe facts provided for the student, the more he/ she is able to evaluate the    \r\noptions/alternatives available to him/ her. \r\nAn Orientation Program for a new student and transferees is          \r\nconducted within two weeks from the start of the semester. The purpose of the \r\norientation program is to familiarize them with the Key officials, rules and   \r\nregulations of the school and other important details that they need to know to \r\nmake their university life easier and enjoyable. \r\nInformation may also be disseminated through lectures, streamers, \r\nf\r\n lyers, leaflets, pamphlets, posters, bulletin board displays, Facebook post      \r\nannouncements via the university public address system, university official \r\npublication and other official virtual site of the University, Guidance and OSDS. \r\nThe Counseling Service. Counseling is considered as the heart of the guidance \r\nprogram. This relationship exists between a helper client/s. This service is \r\navailable to everyone regardless of age, gender preference and status in life.  \r\nCounseling encourages the client/s to express themselves as they would be  \r\ndiscovering their potentials in dealing with their current issues and situation \r\nthat would also help them make sound decisions to take. Ideally in a one-on\r\none, face-to-face situation; however, counseling by text message or phone call \r\nis  allowed if a personal encounter is not possible at the first.   Counselors   \r\nprovide equal opportunity to everyone to avail of the counseling services. \r\nCounseling is done  individually or by groups. All throughout the counseling \r\nprocess, the counselor acts as facilitator and provides support to the client. \r\nTesting Service. Testing is a complement of counseling. Considering its       \r\nobjective nature, it is able to present a realistic view of a student’s learning      \r\nabilities, learning's, interests, and personality. Personality tests are given to       \r\nstudents and personnel to help them understand themselves better.            \r\nPsychological tests that are available in the office and are given by a            \r\nregistered psychometrician under the supervision of the guidance counselor.    \r\nUsing the appropriate tests, students’ problems could be identified; hence, \r\nappropriate intervention may also be given. The manner of test                  \r\nadministration affects its scoring and interpretation. Hence, the counselor \r\nshould endeavor to acquire training on this. \r\nPlacement Service. Placement Service means helping the individual to find \r\nthe right place for himself/herself, not only academically but in other areas \r\nsuch as extracurricular activities. It is assisting him/ her to be in the course \r\nsuited for his/ her capabilities, getting the number of units he/ she could \r\nmanage while being an athlete, a working student, or a parent.  \r\nFollow-up Service. As the term suggests, this service aims to trace the        \r\nstudent both while he/ she is in school and when he/ she has left school by \r\nreason of dropping out or transfer. This service also seeks to determine the \r\nreason why a GSU student is in a specific situation or condition.   \r\nReferral. The Guidance Services Center acts in collaboration with the     \r\nvarious offices within the institution. Referrals to these offices may be \r\nmade when the students need specific assistance of these divisions. Among \r\nthese     \r\noffices are the Registrar’s Office, Office of Student Development \r\nand Services, Clinic, Scholarship Committee, etc. \r\nResearch & Evaluation Service. GSU aims to support the development of the \r\nstudent all throughout his/ her stay in the university. Anything which     \r\nhinders this development is a ground to conduct research. Action          \r\nresearches must be conducted to combat the pressing problems that may \r\nhinders students’      \r\ndevelopment. \r\nThe evaluation service is given at the end of the year. The purpose \r\nof this service is to determine the effectiveness of the different guidance \r\nservices and is a basis for the continuance of the program.",
    "added_at": "2025-11-13T10:07:04.199510"
  },
  "student_handbook_development": {
    "topic": "student handbook development",
    "information": "The Student Handbook Development Committee shall be            \r\nresponsible for revisiting, reviewing, developing and updating the Student \r\nHandbook for wide dissemination, information and guidance of students \r\nand the university  stakeholders. It shall be responsible for archiving and \r\nretrieving previous students’ handbook for purposes of improving the \r\nsame.",
    "added_at": "2025-11-13T10:18:35.252645"
  },
  "policies_on_excursions_field_trips_and_outing": {
    "topic": "Policies on Excursions, Field Trips, and Outing",
    "information": "School excursions, field trips, and outings are necessary                  \r\nco-curricular activities for a well-rounded study of certain subjects. In order \r\nthat the students may derive a maximum educational benefit, they need to \r\nobserve actual situations discussed in the classroom. The success and          \r\neffectiveness of such activities depend largely on careful pre-planning and \r\nbriefing evaluation of the trip should be given upon returning. \r\nC. Policies and Guidelines on Local Off-Campus Activities  \r\nRULE I \r\nRationale and Background \r\nIn accordance with CMO No. 63, series of 2017 “Policies and \r\nGuidelines on Local-Off Campus Activities”, Guimaras State College is    \r\ncommitted to coordinate with the Commission on Higher Education \r\n(CHED) to fully implement the said CMO. \r\nII \r\nStatement of Policies \r\nThrough CMO 63, series of 2017, the college recognizes the role of \r\nlocal-off campus activities in broadening students’ learning opportunities \r\nwhich allow them to experience the real world which served as a motivator \r\nto strengthen the academe-industry linkage. The learning situations include: \r\ninternships, educational tours or field trips, field studies, educational linkages, \r\nstudent development activities, non-curricular-based activities such as      \r\nmission-based, immersion/ reach-out programs, conventions, conferences,     \r\ntrainings, volunteer work, interschool competitions, cultural performances \r\nand team development activities, among others. \r\nIII \r\nObjectives \r\nThis policy specifically aims to: \r\n1. Adopt mechanisms for safety and welfare of all participants to the       \r\noff-campus activities; \r\n2. Observe due diligence and strict adherence to the requirements         \r\nstipulated in CMO 63, series of 2017; \r\n3. \r\nCollaborate with the Department of Tourism (DOT), Department of the       \r\nInterior and Local Government (DILG), Land Transportation Office (LTO), \r\nLand Transportation, Franchising and Regulatory Board (LTFRB), Commission \r\non Higher Education (CHED) to ensure the well-being and safety of all the \r\nstudents. \r\nIV \r\nScope and Coverage \r\nThese guidelines shall follow the provisions of CMO 63, series of 2017, \r\n“Policies and Guidelines on Local-Off Campus Activities”. The implementation \r\nwill cover both higher and advanced education of the university. \r\n1. Ensure safety and welfare of mobility of students through the following \r\ntransportation vehicles: \r\nA.Owned by the HEI \r\nB.Third party or sub-contracting \r\n2. Coordinate with the appropriate LGUs or non-government organizations \r\n(NGOs) \r\n3. Require the students to submit a written consent of the parents or the       \r\nstudents’ guardians and medical clearance, if appropriate. \r\n4. Establish mechanisms to provide parallel for curricular and alternative     \r\nactivities for non-curricular which provide similar acquisition of knowledge \r\nand/or competencies to achieve the learning objectives for students who      \r\ncannot join the activity. These parallel activities shall not be made as a         \r\nsubstitute of a major examination for the purpose of compelling students to \r\nparticipate in said activities. The HEI shall only impose acceptable measures \r\nand non-punitive activities to concerned students. \r\n5. Give the consideration to students or learners with special needs or Persons \r\nwith Disabilities (PWDs). \r\n6. Conduct off-campus activities that shall not unduly benefit or accommodate \r\nany of the establishments owned by HEI or CHED employees and officials or \r\nby an owner who is a relative within the third civil degree of consanguinity or \r\naffinity. \r\nRULE V \r\nRequirements \r\nBefore allowing any student to join in local-off campus activities     \r\nexcept OJT which has a separate CMO, the designated person-in-charge (PIC) \r\nor college deans shall coordinate with the Office of Student Development and \r\nServices (OSDS) to get the list of requirements one (1) month prior to actual \r\nparticipation.",
    "added_at": "2025-11-13T10:22:33.986930"
  },
  "rights_of_students": {
    "topic": "rights of students",
    "information": "Subject to the limitations prescribed by law, College Policies and \r\nRegulations, every student has the following rights: \r\na. \r\nshall have the right to receive quality education in line with the    \r\nnational goals, educational objectives and standards of the college; \r\nb. shall have the right to advertise and guidance to enable him to       \r\nunderstand himself, make intelligent decisions and to select from \r\nalternatives in accordance with his potentials; \r\nc. \r\nshall have the right to participate in the formulation of policies of the \r\ncollege affecting the studentry; \r\nd. shall have the right of free speech and press and to express and      \r\npursue his/ her opinion on any subject, provided that such            \r\nexpression shall not disrupt the normal operations of the college; \r\ne. \r\nf. \r\nshall have the right to general awareness through mass interaction \r\nand other means not contrary to law; \r\nshall have the right to organize and/or participate in organization \r\nsubject to existing college rules and regulations; \r\ng. shall have the right to peaceably assemble for redress of grievances; \r\nh. shall have the right to enjoy academic freedom; \r\ni. \r\nshall have the right to due process before being subjected to            \r\ndisciplinary action; \r\nj. \r\nshall have the right to be informed of the rules and regulations       \r\naffecting them; \r\nk. shall be entitled to respect as a person with human dignity, full     \r\nphysical, social and intellectual development and humane and \r\nhealthful conditions of learning; \r\nl. \r\nshall have the right to seek redress of grievances against any wrong or \r\ninjustice committed against him by any member of the college     \r\ncommunity in accordance with the defined channels of authority; \r\nm. shall have the right to request for his records for purposes of          \r\ndetermining his academic performance; \r\nn. therein up to graduation except in cases of academic deficiency or \r\nviolation of disciplinary regulations; \r\no. shall be entitled of expeditious issuance of certificates, diplomas,    \r\ntranscript of records, grade and transfer credentials; \r\np. shall have the right to avail of all services, medical, library, guidance, etc., \r\nwithin the college premises; \r\nq. shall have the right to pursue his course of study q. shall have the right to \r\nfree expression of information and to publish school newspaper or other \r\nsimilar publications in accordance with article 106; and \r\nr. \r\nshall be free from any form of unreasonable search and seizures; except \r\nwhen the point of ingress or egress by authorized personnel of the college. \r\nArticles illegal or violative of College rule and regulations discovered by \r\nduly authorized personnel shall subject the student to administrative        \r\ndiscipline. Searches can be made by duly authorized personnel even      \r\nwithout search warrant when the student is committing or has just         \r\ncommitted a crime or any serious infraction of college rules and regulations.",
    "added_at": "2025-11-13T16:19:12.769801"
  },
  "school_id_policy": {
    "topic": "school id policy",
    "information": "A.1 Uses of ID \r\nThe ID Card is needed for the following purposes: \r\na. \r\nFor identification purposes; \r\nb. For enrollment. Enrollees, except the entering freshmen and transferees, \r\nshould indicate in all enrollment form their permanent ID number; \r\nc. \r\nFor official business transaction, faculty and staff or college officers may \r\nrequest the student to present his/her school ID for proper identification \r\nduring official transactions; \r\nd. For communication purposes. In claiming their personal letters and    \r\nother documents, students are required to present their school ID; and \r\ne. \r\nFor other official functions of the school, within or outside the school \r\ncampus. \r\nA.2 Validation/Re-issuance of ID: \r\na. \r\nThe student must have a validated ID card at all times while on campus. \r\nb. The ID card must be worn with ID holder visibly displayed upon        \r\nentrance at the gate. ID validation is at the Registrar Office. \r\nc. \r\nThe ID card is strictly non-transferable. \r\nd. Students without ID card shall not be admitted in class unless they      \r\npresent to their teachers and affidavit of loss or their RF. \r\ne. \r\nf. \r\ng. \r\nAdministrators, faculty, security officers are expected to implement the \r\nschool ID policy. \r\nIdentification card must be surrendered to the OSDS upon termination \r\nwith the school. \r\nIdentification card must be surrendered to the OSDS upon termination \r\nfrom the school. The same will be returned to them after it is marked \r\nwith a hole. \r\nh. Students who claim that they lost their ID card should submit to the \r\nOSDS an affidavit of loss and apply for the ID replacement. \r\nA student is authorized to have only one (1) ID card. However, if \r\nfound to have two (2) ID cards, the other ID must be surrendered to the OSDS. \r\nThe “No-ID, No Entry Policy” is observed in all campuses at all times. \r\nThose who would like to enter the school premises without ID shall be        \r\nreported to the Office of Student Development and Services for proper        \r\nendorsement for community service at the GSCSR Office. ID cards must be \r\nworn upon entrance in the campus. It should be worn with a sling (which will \r\nbe identified by the college) around the neck with student’s picture facing \r\nfront. \r\nAll confiscated ID cards must be claimed at the Office of Student     \r\nDevelopment and Services upon presentation of the notice from the GSCSR \r\nthat community services have been complied already. School IDs which are \r\nnot worn properly shall be confiscated by the guard-on-duty or his equivalent \r\nand shall be reported and deposited to the Office of Student Development and \r\nServices. The confiscated ID shall be returned to the students upon presenta\r\ntion of the notice from the GSCSR that community services have been       \r\ncomplied already.",
    "added_at": "2025-11-13T16:25:25.722284"
  },
  "policy_on_student_uniform_and_hair_cut": {
    "topic": "Policy on Student Uniform and Hair Cut",
    "information": "All students who are officially enrolled in more than 9 units are required \r\nto wear prescribed uniform while in campus during school days and major \r\nexamination days or if so required during school programs and other \r\nschool related activities. \r\n• All students who are officially enrolled in more than 9 units are required \r\nto wear prescribed uniform while in the campus during school days and \r\nmajor examination days or if so required during school programs and other \r\nschool related activities. Meanwhile, cross dressing is not allowed. \r\n• Although Wednesday is a “Casual Attire” or “Wash Day” for college         \r\nstudents, they shall wear clothes appropriate for use in the academic     \r\nenvironment. Sports attire, slippers, sandals, sleeveless, short pants,       \r\nspaghetti, halter blouses, plunging neckline/backline, rubber/beach sandals \r\nand slippers are not allowed while inside the school campus. First years to \r\nthird years, they are required to wear the Universal T-shirt. \r\n• Student practice teaching and OJT uniforms are official and must be worn \r\nwith ID or nameplate. \r\nStudent Handbook \r\n• PE and shop/laboratory uniforms must be worn for PE and shop/ laboratory \r\nclasses only. The student must change into prescribed uniform after said \r\nclasses. \r\n• No colored inner shirt is allowed when wearing the school uniform \r\n• Students with P.E. classes shall wear their P.E. uniforms during PE classes \r\nonly. However, those who have PE class in the first period may be allowed \r\nto enter the gate but shall change PE uniform into school uniform after PE \r\nclasses. \r\n• Students with the evening and Saturday classes should wear the prescribed \r\nuniform or official t-shirt and maybe confirmed by the college dean. \r\n• Male students shall be allowed to have their hair-cut in either military,      \r\nbarbers or crew cut. Nobody is allowed to apply hair color. \r\n• Students belong to LGBT QA+ Community can have their hair cut based on \r\ntheir gender preference, provided, it is tidy. \r\n• Violators shall be subjected to sanction in accordance with the regulations in \r\nthe university code and student handbook.",
    "added_at": "2025-11-13T16:27:23.143018"
  },
  "services_offered": {
    "topic": "services offered",
    "information": "1. Library Orientation \r\nThe library conducts orientation to incoming students at the      \r\nbeginning of classes. This is to orient the students on how to optimize use of \r\nthe library. The library orientation is conducted in coordination with the \r\nEnglish Department, where the students are send to the library by section \r\naccording to their schedule as requested and arranged by the subject     \r\nteacher. \r\n2. Announcement of New Acquisitions \r\nThe college or the academic community is informed of the latest \r\nacquisition; the list of new arrivals is posted on the bulletin boards.       \r\nLikewise, an announcement from the college librarian addressed to the \r\ndeans of the different schools and is circulated to the faculty and student \r\ncouncils. The new books are placed on display for browsing. \r\n3. Photocopy and Printing \r\nRequest for photo copying of library materials in different sections \r\nare allowed except thesis and some rare\r\n materials. The students may also \r\nrequest anytime to print their files or documents in the computer. \r\n4. Vertical Files Materials \r\nClippings from newspapers, pamphlets and brochures are compiled \r\nand arranged in alphabetical order. \r\n5. Reference and Information Services. \r\nThis is service given to library user on how and where to locate \r\ninformation needed \r\n6. On Line Public Access Catalog (OPAC) \r\nLibrary collection can be access through the computer instead of \r\nusing the traditional card catalogue. OPAC contains bibliographic re cords \r\nof books and can be accessed in three: author, title and subject. \r\n7. Internet and on- line resources/databases \r\nThe library provides resources in a varied formats to meet the    \r\ndiverse informational; needs of the academic community. Students could \r\naccess internet for free as well as the other on-line resources/databases like \r\nSTARBOOKS, Gale Virtual Reference Library, e-book and e-journals.",
    "added_at": "2025-11-13T16:31:11.119742"
  },
  "food_services": {
    "topic": "food services",
    "information": "Guimaras State University has a clean and comfortable school canteen and \r\ncafeteria where the students can stay during lunch time and can buy nutri\r\ntious foods at affordable price. Managerial position will be rotated among \r\nfaculty/dean who handles subjects with offering courses related to food \r\nservices/ cafeteria management. Tenure of office of the canteen manager \r\nwill be a minimum of two years (2) and a maximum of three years (3).",
    "added_at": "2025-11-13T16:35:47.862423"
  },
  "safety_and_security_services": {
    "topic": "Safety and Security Services",
    "information": "Safety and Security Services ensure a safe, accessible and secure      \r\nenvironment, buildings, and facilities that comply with government standards.    \r\nLicensed and competent security personnel are hired to ensure the safety and \r\nsecurity of students and their belongings. \r\nActivities and programs like Disaster Risk Reduction, Fire Drills and \r\nthe like are conducted to majority of the students, faculty and staff to provide \r\nsafety and security services. \r\nEnsure smooth flow of traffic and maintain traffic rules and regulation \r\nat the main gate and inside the school premises. In addition, all guests are    \r\nrequired to register. In addition, all guests are required to register at the main \r\ngate and wear visitors I.D. upon entrance in the gate.",
    "added_at": "2025-11-13T16:38:58.307889"
  },
  "gender_and_development_services": {
    "topic": "Gender and Development Services",
    "information": "The GSU recognizes and supports the Magna Carta of Women or \r\nR.A 9710 approved on August 14, 2009, Section 13, “Equal Access and          \r\nElimination of Discrimination in Education, Scholarships and Training. \r\nRecognizing the students as target clienteles of the academe, the GAD \r\noffice includes activities and programs that cater to the needs of students such \r\nas peer advocacy addressing gender issues and concerns related to Adolescent \r\nReproductive Health (ARH). \r\nThe GSU recognizes and supports the Magna Carta of Women or \r\nR.A 9710 approved on August 14, 2009, Section 13, “Equal Access and        \r\nElimination of Discrimination in Education, Scholarships and Training. \r\nSection 13 (c) states, “Expulsion and non-readmission of women      \r\nfaculty due to pregnancy outside of marriage shall be outlawed.",
    "added_at": "2025-11-13T16:40:51.994629"
  },
  "scholarship_requirements": {
    "topic": "Scholarship Requirements",
    "information": "1. Maintain the Grade Point Average (GPA) set by the sponsor/           \r\nbeneficiary of the scholarship program. \r\n2. Carry a full semestral load and should finish the course within the         \r\nprescribed course duration. \r\n3. Must not be a recipient of any financial assistance or scholarship grant \r\n(either private or through the school) nor accept any other school. \r\n4. Scholarship privilege after he has been awarded a scholarship grant or \r\nhas given a chance to work as a student assistant in the College. \r\n5. Not have incomplete grades, non-completion of the requirements in \r\nany of the scholar’s subject will disqualify the beneficiary from         \r\nenjoying the scholarship. \r\n6. Submit to the Scholarship Committee OSS a certified copy of grades at \r\nthe end of every term for evaluation. \r\nDocuments to be submitted by the Scholar: \r\n1. Form 138 (Progress report card) or Form 138-A Recent Income Tax \r\nReturn of parents/guardian or a certification from the BIR stating that \r\nthe family is exempted from paying taxes. \r\nStudent Handbook \r\n2. Application form for scholarship signed by parents/guardian \r\n3. 1 piece 1x1 ID picture \r\n4. Good Moral Certification \r\n5. Medical Certification from a government physician (for sports     \r\nvarsity applicant only) \r\n6. Parent’s waiver/permit (for sports/varsity applicant only) \r\n7. Barangay certification as to income of the applicant. \r\n8. 1 white long folder. \r\n9. 1 Fastener \r\nTermination of the Scholarship privilege: \r\n1. Scholastic deficiency \r\n2. Falsification \r\n3. Transfer to another school \r\n4. Dropping-out \r\n5. Involvement in subversive activities in and out of school \r\n6. Non-availability of funds for the scholarship \r\n7. Non-compliance of the terms and conditions stated by the    \r\nbeneficiary of the scholarship program and the GSC Committee \r\non Scholarship \r\n8. Subjection to disciplinary action worse than a five-day           \r\nsuspension from classes.",
    "added_at": "2025-11-13T16:43:31.203395"
  },
  "financial_assistance_to_students": {
    "topic": "Financial Assistance to Students",
    "information": "Financial assistance grants are provided to the students based on \r\nthe guidelines set by CHED and other funding institutions depending on \r\nfunds availability. \r\nCollege deans, Division Chiefs and Council advisers may screen \r\nand recommend to the Director of Student Services, students who are \r\nable, deserving and promising to work as student assistants. The working \r\nhours and academic load shall be based on the recommendation of the \r\ndivision chiefs where he may be assigned. The compensation of the     \r\nstudent assistants shall be in accordance with the approved rate for      \r\nstudent labor.",
    "added_at": "2025-11-13T16:47:39.234781"
  },
  "payment_policies": {
    "topic": "payment policies",
    "information": "1. Students are paid for actual hours worked, and therefore are not \r\npaid for holidays, Saturdays and Sunday. \r\n2. Student assistance shall be paid 25 pesos per hour or a           \r\nmax\r\nimum of 100 pesos per day which is equivalent to 500     pesos a \r\nweek or 2,000 pesos monthly. \r\n3. The university will pay student assistance upon submission of \r\nthe Daily Time Record (DTR) duly signed by the student and his/\r\n her immediate supervisor with accomplishment report. \r\n4. Submission of the Daily Time Record (DTR) and                    \r\nac\r\ncomplishment report will be made at the OSDS who will process \r\nthe student salary. \r\n5. The source of fund will be charge to the department where the \r\nwork student is designated. \r\n6. All payment will be directly made thru the university cashier.",
    "added_at": "2025-11-13T16:49:06.458994"
  },
  "cultural_and_arts_program_services": {
    "topic": "Cultural and Arts Program/Services",
    "information": "The cultural coordinator shall promote and hone the cultural interest, \r\ntalents, abilities and values for appreciation, promotion and conservation of \r\nnational culture and multi-cultural heritage. Alumni and community      \r\ninvolvement for their voluntary service and support to the academic, and \r\ncultural activities is recognized and encouraged to be involved in research \r\nand extension programs and activities of the university. He/ she shall submit \r\naccomplishment reports to the Office of Student Services. GSC offers varied \r\nprograms in cultural and recreational activities. \r\nCultural programs enhance the talents of the students in the field of \r\nculture and arts. Literary and musical contests as well as convocation       \r\nprograms are regularly held to provide a vehicle for the development of \r\ntheir artistic abilities and skills. \r\nEvery student duly registered in this university shall be a member of the \r\nuniversity cultural affairs. There shall be a chair of cultural affairs to be    \r\nappointed by the University President with the recommendation from the \r\ndirector for student services. The committee on cultural affairs has laid \r\ndown the policies, rules and regulations on cultural activities and in        \r\nadministering of the financial aspects of cultural and similar student activi\r\nties of this university.",
    "added_at": "2025-11-13T16:50:39.543064"
  },
  "sports_development_programs": {
    "topic": "Sports Development Programs",
    "information": "The sports coordinator shall promote and hone the sports   \r\nInterest, talents, abilities and values for appreciation among   \r\nstudent. Alumni and community involvement for their voluntary \r\nservice and support to the sports activities is recognized and     \r\nencouraged to be involved in research and extension programs \r\nand activities of the university. He/ she shall submit                  \r\naccomplishment reports to the Office of Student Services. GSU \r\noffers varied programs in sports and recreational activities. Sports \r\ncompetitions are conducted to foster the spirit of sportsmanship, \r\ncamaraderie and unity among students likewise to discover        \r\npotential athletes, trainers, coaches and sports officials. Every   \r\nstudent duly registered in this university shall be a member of the \r\nuniversity sports affairs. There shall be sports coordinator to be \r\nappointed by the University President with the  recommendation \r\nfrom the director for student services. The committee on sports \r\ndevelopment programs has laid down the policies, rules and       \r\nregulations on athletics and in administering of the financial     \r\naspects of athletics and similar student activities of this college. \r\nPOLICY OF VARSITY ATHLETES PROGRAM \r\nI. ACADEMICS \r\n1. Must be officially enrolled in the 1st semester and 2nd semester of \r\nthe current school year. \r\n2. Academic load of at least 12 units in the 1st semester and 2nd   \r\nsemester of the current school year (not including ROTC) and \r\nmust passed the required percentage as follows. \r\nAcademic load \r\n12 units \r\n13-18 units \r\n19 -30 units \r\nPassing Percentage   \r\n100% \r\n70% \r\n60% \r\n12 units \r\n9.1 and up \r\n11.4 units and up \r\n3. Graduating students may carry less than 12 units (With             \r\nCertification from the School’s Registrar)",
    "added_at": "2025-11-13T16:52:59.691628"
  },
  "vision": {
    "topic": "vision",
    "information": "By 2040, GSU is a premier university on education, green technology, innovations, and community transformation excelling in the holistic development of globally competitive, locally responsive and resilient human capital.",
    "added_at": "2025-11-15T09:35:52.068597"
  },
  "mission": {
    "topic": "mission",
    "information": "GSU is committed to produce globally-competitive, technologically-equipped and research-oriented graduates of quality and innovative advanced and higher education programs in sustainable agriculture, fisheries, forestry and tourism, entrepreneurship,liberal arts, education, healthcare, sciences and good governance.",
    "added_at": "2025-11-15T12:04:52.810625"
  },
  "capstone_coordinator": {
    "topic": "capstone coordinator",
    "information": "Sir James Ryan Ga",
    "added_at": "2025-11-17T08:13:30.728295"
  }
}