{
  "university_president_1": {
    "topic": "university president",
    "information": "Dr. Lilian Diana B. Parreño",
    "added_at": "2025-09-05T06:43:50.590367"
  },
  "gsu_hymn_2": {
    "topic": "gsu hymn",
    "information": "In the towns on the Guimaras shores\r\nstands the University we all honor—\r\nGSU, whom we all adore, with our hearts\r\nand minds and souls.\r\n\r\nIn the halls and throughout the world,\r\nshe will rise and never fall,\r\nour beloved Guimaras State University,\r\na center of excellence and green technology.\r\n\r\nExcellent in education and champions of the Earth,\r\nwe are future global builders pushing boundaries,\r\nchasing our dreams, lifting our banners high up into the sky,\r\nthe world cheering for the children, Mabuhay! Mabuhay!\r\n\r\nA university for all in this part of the western shore,\r\nbrothers and sisters united for a common goal\r\nto lift each other up through education and culture\r\nfor the success of one and all.\r\n\r\nIn the halls and throughout the world,\r\nwe are ready to heed her call,\r\nour beloved Guimaras State University\r\nin the towns on the Guimaras shores.\r\n\r\nExcellent in education and champions of the Earth,\r\nwe are future global builders pushing boundaries,\r\nchasing our dreams, lifting our banners high up into the sky,\r\nthe world cheering for the children, Mabuhay! Mabuhay!\r\n\r\nExcellent in education, Mabuhay! Mabuhay!",
    "added_at": "2025-09-05T09:26:27.616958"
  },
  "cst_dean_3": {
    "topic": "cst dean",
    "information": "Adrian J. Forca, MIT",
    "added_at": "2025-09-05T09:30:48.862256"
  },
  "gsu_history_4": {
    "topic": "gsu history",
    "information": "Guimaras State University had its humble beginnings as a secondary vocational institution, the Buenavista Vocational School (BVS), which was established through Republic Act 3933 in 1964, with Representative Rodolfo Ganzon of the 2nd District of Iloilo as the principal sponsor.",
    "added_at": "2025-09-05T09:39:11.913059"
  },
  "gsu_mandate_5": {
    "topic": "gsu mandate",
    "information": "The University shall primarily provide advance education, higher technological, professional instruction and training in the fields of education, technology, agriculture, fisheries, engineering, arts and sciences, forestry, business administration, hotel and restaurant management, tourism, health sciences, computer technology, criminology, maritime and aviation education, and other related fields of study. It shall also undertake research and extension services, as well as production activities, in support of the socioeconomic development of the Province of Guimaras and Region VI, and provide progressive leadership in its areas of specialization.",
    "added_at": "2025-09-05T09:41:30.492091"
  },
  "gsu_goals_6": {
    "topic": "gsu goals",
    "information": "Goals\r\n1. Instruction\r\nProvide quality education and produce globally competitive, technologically equipped and research-oriented graduates in advanced and higher education programs.\r\n\r\n2. Research\r\nCultivate locally rooted, globally competitive and responsive research culture among faculty, staff and students.\r\n\r\n3. Extension\r\nEngage the faculty, staff and students in sustainable extension services to improve quality of life in the community.\r\n\r\n4. Governance\r\nStrengthen administrative operation, develop human capital and intensify fiscal management for the efficient and effective delivery of public service.",
    "added_at": "2025-09-05T09:45:06.821443"
  },
  "gsu_objectives_7": {
    "topic": "gsu objectives",
    "information": "## Objectives\r\n1. Instruction\r\n   1. Develop and offer programs responsive to the needs of the Nation and industries.\r\n   2. Secure certifications and recognition from credible bodies (Accrediting Agency of Chartered Colleges and Universities in the Philippines (AACCUP), Institutional Sustainability Assessment (ISA), Accreditation Board for Engineering and Technology (ABET), Times Higher Education (THE), Quacquarelli Symonds (QS), SUC Leveling).\r\n   3. Achieve Licensure and first-generation graduate targets.\r\n   4. Ensure career advancement and employability of graduates.\r\n   5. Provide a vibrant and supportive environment for faculty professional development.\r\n   6. Promote initiatives and coordinate college/programs toward student completion and learning outcomes in a holistic environment.\r\n   7. Maintain high quality flexible learning strategies to accommodate wide-ranging students’ needs and experiences.\r\n   8. Provide quality training for tertiary and advanced education and advocate sustainable development through green technology generation.\r\n   9. Develop responsible, environment-friendly, productive, healthy and sports -oriented citizens who can contribute to the attainment of local and national goals.\r\n   10. Foster planning for excellence in instruction, research and community engagement.\r\n   11. Create a vibrant ASEAN/Trans-international and Distance Education.\r\n   12. Innovate research-based pedagogy to foster equitable and inclusive education.\r\n   13. Continue ISO Certification for the management of tertiary and advanced education.\r\n2. Governance\r\n   1. Conduct periodic review, evaluation, and re-engineering of the processes, structures and system.\r\n   2. Improve the delivery of services to stakeholders/clients.\r\n   3. Strengthen the implementation of the automation and digitalization of the administrative and financial management system for efficient and transparent service.\r\n   4. Enhance Human Resource Learning and Development.\r\n3. Research, Extension, Training, and Innovations\r\n   1. Conduct, manage, and supervise gender-responsive Research and Extension activities in consonance with the institutional, national, and international goals.\r\n   2. Present quality research outputs and extension projects in local, national, and international fora and symposia.\r\n   3. Publish research outputs and other scholarly works in reputable publications with Scopus and/or International Scientific Indexing for wide dissemination and circulation.\r\n   4. Establish and intensify the University’s collaboration with public and private local and international organizations towards sustainable development through sharing of resources, skills, expertise, and knowledge.\r\n   5. Extend mature technologies, programs, and innovations to enhance skills, and competencies of stakeholders/clients.\r\n   6. Utilize protected research outputs for technology transfer and commercialization.\r\n   7. Ensure continuous quality improvement in Research, Extension, Training, and Innovations.",
    "added_at": "2025-09-05T09:49:51.702821"
  },
  "gsu_8": {
    "topic": "gsu",
    "information": "Guimaras State University (GSU) is a public university in the island province of Guimaras, Philippines. It is mandated to provide advanced education, higher technological, professional instruction and training in the fields of education, technology, agriculture, fisheries, engineering, arts and sciences, forestry, business administration, hotel and restaurant management, tourism, health sciences, computer technology, criminology, maritime and aviation education, and other related fields of study. It consists of three campuses: the Salvador Campus, Mosqueda Campus, and Baterna Campus.",
    "added_at": "2025-09-05T09:54:56.794922"
  },
  "campus_director_of_gsu_mosqueda_campus_9": {
    "topic": "campus director of gsu mosqueda campus",
    "information": "Dr. Kert D. Pillora",
    "added_at": "2025-09-05T14:02:15.190171"
  },
  "salvador_campus_10": {
    "topic": "salvador campus",
    "information": "Guimaras State University's main campus, known as the Salvador Campus, is located in McLain, Buenavista, the most populous municipality in Guimaras. It occupies a 5-hectare area and serves as the central location for the university's operations and academic programs. The campus offers various undergraduate and graduate programs and is known for its qualified faculty and scholarship opportunities.",
    "added_at": "2025-09-06T14:42:09.047655"
  },
  "tell_me_about_mosqueda_campus_11": {
    "topic": "tell me about mosqueda campus",
    "information": "Mosqueda Campus Colleges:\r\n1. College of Science and Technology (CST)\r\n2. College of Business and Management (CBM)\r\n\r\nMosqueda Campus Courses:\r\n1. Bachelor of Science in Business Administration (Major in: Financial Management, Marketing Management, Human Resource Management)\r\n2. Bachelor of Science in Entrepreneurship\r\n3. Bachelor of Science in Real Estate Management\r\n4. Bachelor of Science in Information Technology\r\n5. Bachelor of Science in Computer Science\r\n6. Bachelor of Science in Information System\r\n7. Bachelor of Science in Entertainment and Multimedia Computing\r\n8. Bachelor of Library and Information Science\r\n\r\nMosqueda campus has atleast 1000 students now",
    "added_at": "2025-09-07T06:54:34.376893"
  },
  "salvador_campus_12": {
    "topic": "salvador campus",
    "information": "Salvador Campus:\r\nGuimaras State University's main campus, known as the Salvador Campus, is located in McLain, Buenavista, the most populous municipality in Guimaras. It occupies a 5-hectare area and serves as the central location for the university's operations and academic programs. The campus offers various undergraduate and graduate programs and is known for its qualified faculty and scholarship opportunities.\r\n\r\nSalvador Campus Colleges:\r\n1. College of Teacher Education (CTE)\r\n2. College of Arts and Sciences (CAS)\r\n3. College of Business Administration (CBA)\r\n4. College of Engineering and Industrial Technology (CEIT)\r\n5. College of Criminal Justice Education (CCJE)\r\n6. College of Tourism and Hospitality Management (CTHM)\r\n7. Graduate School\r\n\r\nSalvador Campus Courses:\r\n1. Bachelor of Arts in English Language Studies\r\n2. Bachelor of Public Administration\r\n3. Bachelor of Science in Hospitality Management\r\n4. Bachelor of Science in Tourism Management\r\n5. Bachelor of Science in Criminology (Board Course)\r\n6. Bachelor of Industrial Technology (Major in: Automotive Technology, Electrical Technology, Electronics Technology, Mechanical Technology)\r\n7. Bachelor of Science in Electrical Engineering (Board Course)\r\n8. Bachelor of Science in Mechanical Engineering (Board Course)\r\n9. Bachelor of Elementary Education (Board Course)\r\n10. Bachelor of Technology and Livelihood Education (Major in: Industrial Arts, Home Economics and Livelihood Education)\r\n11. Master in Public Administration\r\n12. Master in Education\r\n13. Master of Arts in Teaching Mathematics\r\n14. Master in Business Administration\r\n15. Doctor of Philosophy in Educational Management\r\n16. Doctor in Management (Major in: Business Administration, Human Resource Management)\r\n17. Doctor of Education in Curriculum and Instruction",
    "added_at": "2025-09-07T06:57:47.491638"
  },
  "baterna_campus_13": {
    "topic": "baterna campus",
    "information": "Baterna Campus:\r\nThe Baterna Campus of Guimaras State University (GSU) is located in Constancia, San Lorenzo, Guimaras, Philippines. It primarily serves as the home for the university's College of Agricultural Sciences (CAgS).\r\n\r\nBaterna Campus Colleges:\r\n1. College of Agricultural Sciences (CAGS).\r\n\r\nBaterna Campus Courses:\r\n1. Bachelor of Science in Agriculture (Board Course)\r\n2. Bachelor of Science in Food Technology\r\n3. Bachelor of Science in Fisheries (Board Course)",
    "added_at": "2025-09-07T07:00:37.931105"
  },
  "quality_policy_14": {
    "topic": "quality policy",
    "information": "Guimaras State University (GSU) aims to have an effective and efficient implementation of its quality management system along with its vision, mission and core values. To achieve this, GSU will produce globally competitive, technologically-equipped and research-oriented graduates of quality and innovative advanced and higher education programs in sustainable agriculture, fisheries, forestry and tourism, entrepreneurship, liberal arts, education, healthcare, science and good governance. It shall endeavor to continually improve its quality management system, satisfying applicable requirements of the standard, addressing risks and maximizing opportunities. Further, the top Management pledges to inspire a university-wide commitment to this Policy and ensure to regularly review and monitor strategic implementation of the Quality Management System in all levels of the organization for customer’s satisfaction and continual improvement.",
    "added_at": "2025-09-07T07:02:58.342866"
  },
  "core_values_15": {
    "topic": "core values",
    "information": "a. God-Fearing\r\nb. People Centered\r\nc. Pro – Environment\r\nd. Selfless Public Service\r\ne. Respect for Human Dignity",
    "added_at": "2025-09-07T09:17:20.754668"
  },
  "cst_dean_16": {
    "topic": "cst dean",
    "information": "Prof. Adrian J. Forca, MIT",
    "added_at": "2025-09-08T08:02:04.659272"
  },
  "program_head_of_bsit_17": {
    "topic": "program head of bsit",
    "information": "Divon G. Tamdang",
    "added_at": "2025-09-08T08:53:05.844142"
  },
  "who_is_the_university_president_18": {
    "topic": "who is the university president",
    "information": "Dr. Lilian Diana B. Parreño",
    "added_at": "2025-09-08T10:51:05.077254"
  },
  "the_developer_of_this_system_19": {
    "topic": "the developer of this system",
    "information": "EJay",
    "added_at": "2025-09-08T11:02:39.995300"
  },
  "registrar_of_gsu_20": {
    "topic": "registrar of gsu",
    "information": "Ronel P. Dulla",
    "added_at": "2025-09-12T13:11:23.538210"
  },
  "how_many_laboratory_rooms_does_gsu_mosqueda_campus_have_21": {
    "topic": "how many laboratory rooms does gsu mosqueda campus have",
    "information": "four rooms. lab a to d",
    "added_at": "2025-09-13T15:12:16.005168"
  },
  "when_did_gsc_became_gsu_22": {
    "topic": "when did gsc became gsu",
    "information": "The 15th Congress enacted House Bill 06634 (An Act Converting\n\nthe Guimaras State College in The Province of Guimaras Into a State\n\nUniversity to Be Known as The Guimaras State University and Appropriating\n\nFunds Therefor) by former Congressman Joaquin Carlos Rahman Nava. In\n\nDecember 2014, Cong. Rahman Nava refiled HB 05181 in the 16th Congress,\n\nwhich the House approved and sent to the Senate. In the 17th\n\nCongress - Hon. Ma. Lucille Ledesma Nava sponsored HB 07953 to convert\n\nGSC to GSU. On April 26, 2019, President Rodrigo R. Duterte signed Repub\n\nlic Act 11335 an act converting the Guimaras State College into Guimaras\n\nState University. In June 7, 2022, the CHED Commission en Banc\n\nconfirmed the conversion of Guimaras State College into Guimaras State\n\nUniversity.",
    "added_at": "2025-09-14T16:04:58.789349"
  },
  "resolved:_bision_23": {
    "topic": "RESOLVED: bision",
    "information": "[CORRECTED] This question has been marked as resolved by admin on 2025-09-15 08:28",
    "added_at": "2025-09-15T08:28:43.089160"
  },
  "institutional_outcome_for_instruction_24": {
    "topic": "Institutional Outcome for Instruction",
    "information": "1. Spiritually and morally upright individuals\n\n2. Globally competent professionals\n\n3. Productive and Environment friendly\n\n4. Entrepreneurial and technologically innovative\n\n5. Goal-oriented and service committed\n\n6. Sustainable development advocate",
    "added_at": "2025-09-15T12:52:53.626593"
  },
  "goals_of_the_college_of_science_and_technology_25": {
    "topic": "Goals of the College of Science and Technology",
    "information": "1. Provide quality and excellent education and training for the higher manpower skills of technologist, technicians and professionals;\n\n2. Strengthen community involvement for technological and industrial development of the nation;\n\n3. Undertake relevant technological researches and innovations that promote the uses of renewable resources and the conservation of energy and natural resources;\n\n4. Promote production of high-quality goods and efficient services through green technology for socio-economic development.",
    "added_at": "2025-09-15T12:55:09.519415"
  },
  "program_objectives_of_bscs_26": {
    "topic": "Program Objectives of BSCS",
    "information": "A. Develop students for a career in the industry equipped with adequate knowledge and skills to become competent applications developer, computer science instructor, database programmer/designer, information security engineer, quality assurance engineer, researcher, systems developer and systems analyst.\n\nB. Strengthen students capability to become competent global practitioners by actively engaging them through the application and utilization of information and communication technology on instruction, research, extension and production.",
    "added_at": "2025-09-15T12:57:35.725529"
  },
  "bscs_program_outcomes_[cmo_25,_s._2015_section_6.3.a]_27": {
    "topic": "BSCS Program Outcomes [CMO 25, s. 2015 Section 6.3.A]",
    "information": "1. Apply knowledge of computing fundamentals, knowledge of a computing specialization, and mathematics, science, and domain knowledge appropriate for the computing specialization to the abstraction to the abstraction and conceptualization of computing models from defined problems and requirements.\n\n2. Identify, analyze, formulate, research literature, and solve complex computing problems and requirements reaching substantiated conclusions using fundamental principles of mathematics, computing sciences, and relevant domain disciplines.\n\n3. An ability to apply mathematical foundations, algorithmic principles, and computer science theory in the modeling and design of computer-based systems in a way that demonstrates comprehension of the tradeoffs involved in design choices.\n\n4. Knowledge and understanding of information security issues in relation to the design, development, and use of information systems.\n\n5. Design and evaluate solutions for complex computing problems, and design and evaluate systems, components, or processes that meet specified needs with appropriate consideration for public health and safety, cultural, societal, and environment considerations.\n\n6. Create, select, adapt, and apply appropriate techniques, resources, and modern computing activities, with an understanding of the limitations to accomplish a common goal.\n\n7. Function effectively as an individual and as a member or leader in diverse teams and in multidisciplinary settings.\n\n8. Communicate effectively with the computing community and with society at large about complex computing activities being able to comprehend and write effective reports, design documentation, make effective presentations, and give and understand clear instructions.\n\n9. An ability to recognize the legal, social, ethical, and professional issues involved in the utilization of computer technology and be guided by the adoption of appropriate professional, ethical, and legal practices.\n\n10. Recognize the need, and have the ability, to engage in independent learning for continual development as a computing professional.",
    "added_at": "2025-09-15T13:02:37.429347"
  },
  "bscs_curriculum_effective_1st_sem,_ay_2025-2026_28": {
    "topic": "BSCS Curriculum Effective 1st Sem, AY 2025-2026",
    "information": "General Education Courses:\n\nGE 1 - Purposive Communication\n\nGE 2- Readings in Philippine History\n\nGE 3- Mathematics in the Modern World\n\nGE 4 - Art Appreciation\n\nGE 5 - Understanding the Self\n\nGE 6 - Ethics\n\nGE 7 - The Contemporary World\n\nGE 8- Science, Technology and Society\n\nGE 9- Technical Writing with Oral Communication\n\nCommon Courses:\n\nCC 01 - Introduction to Computing\n\nCC 02 -Fundamentals of Programming\n\nCC 03 - Intermedia Programming\n\nProfessional Courses:\n\nCS 1 -Programming Logic Formulation\n\nCS 2- Discrete Structures I\n\nCS 3 - System Fundamentals\n\nCS 4- Networks and Communications\n\nInstitutional:\n\nGTE - Green Technology Education I\n\nPhysical Education:\n\nPE 1 - Physical Activities Towards Health and Fitness 1 (PATHFit 1): Movement Competency Training\n\nPE 2 - Physical Activities Towards Health and Fitness 2 (PATHFit 2): Exercise-based Fitness Activities\n\nNSTP:\n\nNSPT 1 - CWTS/ ROTC/ LTS\n\nNSPT 2 - CWTS/ ROTC/ LTS",
    "added_at": "2025-09-15T13:06:43.704772"
  },
  "program_objectives_of_bachelor_of_science_in_entertainment_and_multimedia_computing_29": {
    "topic": "Program Objectives of Bachelor of Science in Entertainment and Multimedia Computing",
    "information": "A. Promote innovative digital animation content and applications that adhere to ethical and professional standards;\n\nB. Produce innovative solutions and creative content that address the evolving needs of the entertainment and multimedia industries.\n\nC. Generate research-driven outcomes that contribute to the advancement of knowledge and practices in entertainment and multimedia computing; and\n\nD. Foster creativity and critical thinking skills to solve complex problems in multimedia design and entertainment technology.",
    "added_at": "2025-09-15T13:09:18.293071"
  },
  "bachelor_of_science_in_entertainment_and_multimedia_computing_program_outcomes_[cmo_2,_s._2014_section_6.2]_30": {
    "topic": "Bachelor of Science in Entertainment and Multimedia Computing Program Outcomes [CMO 2, s. 2014 Section 6.2]",
    "information": "1. Apply knowledge of mathematics, physical sciences, computing sciences to the practice of being an entertainment and\n\nmultimedia computing professional.\n\n2. Specialized computing knowledge in each applicable field, and the ability to apply such knowledge to provide solutions to actual problems.\n\n3. A knowledge of contemporary issues.\n\n4. Analyze project requirements and to design and implement project prototypes.\n\n5. Recognize, formulate, and solve computing problems.\n\n6. Design, build, improve, and deploy products that meets client needs within realistic constraints.\n\n7. Use the appropriate techniques, skills and modern computing tools necessary for the practice of being a professional game developer or animator.\n\n8. Work effectively in multi-disciplinary and multi- cultural teams.\n\n9. Effectively communicate orally and in writing using the English language.\n\n10. Understand and assess local and global impacts of computing on society relevant to professional computing practice and subscription to accepted industry standards.\n\n11. Understand the effects and impact of entertainment and multimedia computing projects on nature and society, and of their social and ethical responsibilities.\n\n12. Create or use modified artifacts in consideration of intellectual property rights of the author.\n\n13. Engage in life-long learning and an acceptance of the need to keep current of the development in the specific field of specialization.\n\n14. Demonstrate original creative outputs.\n\n15. Demonstrate innovativeness in their outputs.\n\n16. Demonstrate client-centric service.",
    "added_at": "2025-09-15T13:11:55.932633"
  },
  "program_objectives_of_bachelor_of_library_and_information_science_31": {
    "topic": "Program Objectives of Bachelor of Library and Information Science",
    "information": "A. Equip students with essential skills in managing, organizing, and accessing information in both physical and digital formats, ensuring proficiency in cataloging, classification, and archiving systems.\n\nB. Encourage students to engage in research methodologies and critical analysis of information systems, allowing them to evaluate, select, and apply the best practices for information retrieval and dissemination in diverse contexts.\n\nC. Prepare students to integrate emerging technologies into library and information services, emphasizing the use of digital tools, databases, and information management software to meet the evolving needs of information users.\n\nD. Instill a strong sense of ethics and responsibility in students, emphasizing the importance of intellectual freedom, privacy, and the role of libraries and information professionals in supporting lifelong learning and community development.",
    "added_at": "2025-09-15T13:14:19.193289"
  },
  "bachelor_of_library_and_information_science_program_outcomes_[cmo_24,_s._2015_section_6.2]_32": {
    "topic": "Bachelor of Library and Information Science Program Outcomes [CMO 24, s. 2015 Section 6.2]",
    "information": "1. Select, evaluate, organize and disseminate print, multimedia, electronic and digital information resources.\n\n2. Effectively communicate orally and in writing, at the same time, use a variety of communication methods in a manner that best enables the message to be understood.\n\n3. Demonstrate logical and systematic approaches to the accomplishment of tasks.\n\n4. Formulate objectives, policies and processes as well as design and manage resources in anticipation of future educational or organizational changes.\n\n5. Recognize, analyze and constructively solve problems, provide appropriate direction and assistance, and overcome barriers when necessary.\n\n6. Identify users’ needs and wants through reference interviews. customer surveys, complaint logs and other means in order to evaluate the effectiveness of current services and improve these and other practices.\n\n7. Work well in groups and seek ways to build team efforts to solve problems and achieve common goals.\n\n8. Understand library’s automation systems and the use of computer hardware, software and peripherals, including online collaboration tools (the Internet, the worldwide web, and social networking sites) i) develop information technology solutions (e.g.. library automation system. Website, e-mail system, etc.).\n\n9. Conduct significant research projects that will benefit the library and the organization.\n\n10. Evaluate and debate information policy (e.g., copyright law, plagiarism, cybercrimes, etc.) and ethical issues applicable in local, national or global context.\n\n11. Participate in continuing education activities organized by library associations and other entities.",
    "added_at": "2025-09-15T13:17:33.951208"
  },
  "program_objectives_of_bachelor_of_science_in_information_systems_33": {
    "topic": "Program Objectives of Bachelor of Science in Information Systems",
    "information": "A. Produce graduates who are equipped with current technologies and tools, as well as, quality assurance methodologies that will lead to the development of implementation-ready information systems.\n\nB. Enhance awareness on how to methodically and practically approach a variety of technical, organizational, and managerial issues to ultimately improve C. ICT integration towards the attainment of strategic business advantage.\n\nD. Inculcate among students the essential virtues and attitudes, as well as develop necessary knowledge and competency levels required of an information technology professional.\n\nE. Train students to systematically appraise the quality of computer-based information systems against user needs and requirements to guarantee user acceptance and implement ability.",
    "added_at": "2025-09-15T13:20:16.406284"
  },
  "bachelor_of_science_in_information_systems_program_outcomes_[cmo_25,_s._2015_section_6.3.b]_34": {
    "topic": "Bachelor of Science in Information Systems Program Outcomes [CMO 25, s. 2015 Section 6.3.B]",
    "information": "1. Apply knowledge of business processes, computer, mathematics and social sciences appropriate to Information Systems\n\n2. Analyze a problem, identify and define the computing requirements with respect to organizational factors appropriate to its solution and plan strategies for their solution\n\n3. Evaluate information systems in terms of general quality attributes and possible trade-offs presented with the given requirement\n\n4. Design, implement, and evaluate information systems, processes, components, or programs and to source cost-benefits efficient alternatives to meet desired needs, goals and constraints\n\n5. Use knowledge and understanding of enterprises in modelling and design of information systems\n\n6. Deploy and use effectively skills, tools and techniques necessary for information systems practice\n\n7. Function effectively on teams (recognizing the different roles within a team and different ways of organizing teams) to accomplish a common goal\n\n8. Communicate effectively with a range of audiences Communication skills includes technical writing, presentation and negotiation and numeracy\n\n9. Recognize the legal, social, ethical and professional issues involved in the exploitation of computer technology, and be guided by the adoption of appropriate professional, ethical and legal practices both in the local and global community\n\n10. Recognize the need for and engage in an independent and life-long learning, planning self-learning and improving performance as the foundation for on-going professional development",
    "added_at": "2025-09-15T13:22:16.713245"
  },
  "program_objectives_of_bachelor_of_science_in_information_technology_(bsit)_35": {
    "topic": "Program Objectives of Bachelor of Science in Information Technology (BSIT)",
    "information": "A. Produce globally competitive, innovative, God-fearing, morally upright and productive information technology professionals;\n\nB. Transfer ICT knowledge and skills for better quality of life of the community;\n\nC. Develop research capabilities for industrial and technological innovations;\n\nD. Engage in revenue-generating ICT jobs and other environment-friendly computing services.",
    "added_at": "2025-09-16T14:42:16.289019"
  },
  "bachelor_of_science_in_information_technology_(bsit)_program_outcomes_[cmo_25,_s._2015_section_6.3.c]_36": {
    "topic": "Bachelor of Science in Information Technology (BSIT) Program Outcomes [CMO 25, s. 2015 Section 6.3.C]",
    "information": "1. Apply knowledge of computing, science, and mathematics appropriate to the discipline\n\n2. Understand best practices and standard and their applications\n\n3. Analyze complex problems, and identify and design the computing requirements appropriate to its solution\n\n4. Identify and analyze user needs and take them into account in the selection, creation, evaluation and administration of computer-based systems\n\n5. Design, implement, and evaluate computer-based systems, processes, components, or programs to meet desired needs and requirements under various constraints\n\n6. Integrate IT-based solutions into the user environment effectively\n\n7. Apply knowledge through the use of current techniques, skills, tolls, and practices necessary for the IT Profession\n\n8. Function effectively as a member or leader of a development team recognizing the different roles within a team to accomplish a common goal\n\n9. Assist in the creation of an effective IT Project Plan\n\n10. Communicate effectively with the computing community and with society at large about complex computing activities through logical writing, presentations, and clear instructions\n\n11. Analyze the local and global impact of computing information technology on individuals, organizations, and society\n\n12. Understand professional, ethical, legal and security and social issues and responsibilities in the utilization of information technology\n\n13. Recognize the need for and engage in planning self-learning and improving performance as a foundation for continuing professional development",
    "added_at": "2025-09-16T14:44:43.826617"
  },
  "bsit_curriculum_effective_1st_sem,_ay_2025-2026_37": {
    "topic": "BSIT Curriculum Effective 1st Sem, AY 2025-2026",
    "information": "General Education Courses\n\n[GE 1] Understanding the Self\n\n[GE 2] Readings in Philippine History\n\n[GE 3] Contemporary World\n\n[GE 4] Mathematics in the Modern World\n\n[GE 5] Purposive Communication\n\n[GE 6] Art Appreciation\n\n[GE 7] Science, Technology and Society\n\n[GE 8] Ethics",
    "added_at": "2025-09-16T14:45:57.517344"
  },
  "osds_objectives_38": {
    "topic": "osds objectives",
    "information": "1. Enhance the capability of clubs/ organizations adviser’s and student\n\nleaders to develop well-rounded and globally competitive graduates.\n\n2. Generate funding for Scholarship from various funding donors.\n\n3. Provide continuous skills enhancement for active participation of\n\nstudents to the programs and activities of the university.\n\n4. Promote the research culture among students on development and community extension services.\n\n5. Develop sense of responsibility among students to make Guimaras State\n\n6. University a green technology campus through environment friendly\n\nactivities, programs and services.",
    "added_at": "2025-09-16T14:52:52.015372"
  },
  "who_is_the_program_head_of_bscs_39": {
    "topic": "who is the program head of bscs",
    "information": "Lea P. Ymalay",
    "added_at": "2025-09-19T14:40:46.078046"
  },
  "who_is_the_program_head_of_bsis_40": {
    "topic": "who is the program head of bsis",
    "information": "Loveson C. Gallos",
    "added_at": "2025-09-19T15:10:18.755825"
  },
  "who_is_the_dean_of_cags_41": {
    "topic": "who is the dean of cags",
    "information": "Dr. Rhea Joy D. Flora",
    "added_at": "2025-09-20T14:25:35.443623"
  },
  "cags_42": {
    "topic": "cags",
    "information": "College of Agricultural Sciences",
    "added_at": "2025-09-20T14:29:24.148603"
  },
  "cas_43": {
    "topic": "cas",
    "information": "College of Arts and Sciences",
    "added_at": "2025-09-21T06:51:02.614150"
  },
  "who_is_the_dean_of_cas_44": {
    "topic": "who is the dean of cas",
    "information": "Dr. Bernardo G. Cagasan",
    "added_at": "2025-09-21T08:57:21.351060"
  },
  "ccje_45": {
    "topic": "ccje",
    "information": "College of Criminal Justice Education (CCJE)\n\nDean: Dr. Jasmin L. Parreño",
    "added_at": "2025-09-21T09:25:25.650146"
  },
  "ceit_46": {
    "topic": "ceit",
    "information": "College of Engineering and Industrial Technology (CEIT)\n\nDean: Engr. Conrado S. Calumpita",
    "added_at": "2025-09-21T09:27:32.548746"
  },
  "cte_47": {
    "topic": "cte",
    "information": "College of Teacher Education (CTE)\n\nDean: Dr. Jasmin T. Gadian",
    "added_at": "2025-09-21T09:29:11.042121"
  },
  "dean_of_graduate_school_48": {
    "topic": "dean of graduate school",
    "information": "Dr. Erly M. Martir",
    "added_at": "2025-09-21T09:31:05.692386"
  },
  "baterna_campus_director_49": {
    "topic": "baterna campus director",
    "information": "Dr. Rhea Joy D. Flora",
    "added_at": "2025-09-21T09:33:22.673951"
  },
  "dr._rhea_joy_d._flora_50": {
    "topic": "Dr. Rhea Joy D. Flora",
    "information": "dean of cags, baterna campus director",
    "added_at": "2025-09-21T09:41:14.234321"
  },
  "dr._erly_m._martir_51": {
    "topic": "Dr. Erly M. Martir",
    "information": "Vice President for Academic Affairs, dean of graduate school",
    "added_at": "2025-09-21T11:46:13.797662"
  },
  "vice_president_for_research,_extension,_training_and_innovation_52": {
    "topic": "Vice President for Research, Extension, Training and Innovation",
    "information": "Dr. Julius T. Vergara",
    "added_at": "2025-09-21T11:49:29.095996"
  },
  "vice_president_for_administration_and_finance_53": {
    "topic": "Vice President for Administration and Finance",
    "information": "Janet R. Aleman",
    "added_at": "2025-09-21T11:50:03.327257"
  },
  "system_name_54": {
    "topic": "system name",
    "information": "ChatBook AI",
    "added_at": "2025-10-28T17:13:38.934441"
  },
  "main_color": {
    "topic": "main color",
    "information": "blue",
    "added_at": "2025-10-28T17:22:29.822783"
  }
}